{"version":"1","records":[{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen"},"type":"lvl1","url":"/chapter01-sec01","position":0},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen"},"content":"Es gibt viele Gründe, warum es sich lohnt, Programmieren zu lernen. Die\nNachfrage nach Ingenieurinnen und Ingenieuren, die zusätzlich Programmieren\nkönnen, wächst aufgrund der Digitalisierung der Industrie rasant. Programmieren\nfördert kritisches Denken und Problemlösungsfähigkeiten. Umgekehrt werden durch\nProgrammieren diese Fähigkeiten weiter entwickelt. Zudem fördert Programmieren\ndas Verständnis von Technologie und Computersystemen. Es kann helfen, die\nFunktionsweise von Software und Hardware besser zu verstehen und Einblicke in\ndie Arbeitsweise von Websites, Anwendungen und anderen Technologien zu gewinnen.\nProgrammierung kann auch dabei helfen, Routineaufgaben zu automatisieren und\nZeit zu sparen. Dies kann Fehler minimieren und die Effizienz steigern.","type":"content","url":"/chapter01-sec01","position":1},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Lernziele"},"type":"lvl2","url":"/chapter01-sec01#lernziele","position":2},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Lernziele"},"content":"Lernziele\n\nSie können erklären, was ein Algorithmus ist.\n\nSie wissen, was eine Programmiersprache ist.\n\nSie kennen den Unterschied zwischen höheren Programmiersprachen und\nMaschinensprache.\n\nSie wissen, was der Unterschied zwischen einer kompilierten\nProgrammiersprache und einer interpretierten Programmiersprache ist. Sie\nkönnen für beide Kategorien Beispiele benennen.","type":"content","url":"/chapter01-sec01#lernziele","position":3},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Algorithmus"},"type":"lvl2","url":"/chapter01-sec01#algorithmus","position":4},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Algorithmus"},"content":"Programmieren bedeutet, dem Computer eine Reihe von Anweisungen zu geben. Es\ngeht darum, mit Hilfe einer Abfolge von Anweisungen ein Problem zu lösen. Ein\nwichtiger Aspekt des Programmierens ist die Fähigkeit, komplexe Probleme in\nkleinere, leichter zu lösende Aufgaben zu unterteilen. Diese Aufgaben können\ndann einzeln gelöst und in einem größeren Programm kombiniert werden, um das\nProblem als Ganzes zu lösen.\n\nDiese schrittweise Beschreibung der Lösung eines Problems nennt man\nAlgorithmus. Ein Algorithmus ist ein klar definierter Satz von Anweisungen\noder Regeln, die von einem Computer (oder auch von einem Menschen) ausgeführt\nwerden können, um ein bestimmtes Ergebnis zu erzielen.\n\nEin Beispiel aus dem Alltag ist die Steuerung eines Fahrstuhls:\n\nJemand drückt im Erdgeschoss den Knopf.\n\nDer Fahrstuhl fährt nach unten, hält an, und die Tür öffnet sich.\n\nDie Person steigt ein und wählt die 3. Etage.\n\nDer Fahrstuhl schließt die Tür, fährt hoch bis zur 3. Etage, hält wieder an,\nöffnet die Tür und die Person steigt aus.\n\nMini-Übung\n\nNehmen Sie sich 5 Minuten Zeit und schreiben Sie die Schritte auf, die ein\nFahrstuhl befolgen muss, um eine Person vom Erdgeschoss in die 2. Etage zu\nbringen.\n\nLösung\n\nWarte auf Knopfdruck im Erdgeschoss.\n\nFahre ins Erdgeschoss (falls nicht schon dort).\n\nÖffne Tür.\n\nWarte, bis Person eingestiegen ist.\n\nSchließe Tür.\n\nFahre in die 2. Etage.\n\nÖffne Tür.\n\nWarte, bis Person ausgestiegen ist.\n\nSchließe Tür.\n\nDie obige Lösung funktioniert nur für den Transport vom Erdgeschoss in die 2.\nEtage. Ein echter Fahrstuhl-Algorithmus muss aber allgemeiner sein und für\nbeliebige Start- und Zieletagen funktionieren. Das folgende Flussdiagramm zeigt\neinen solchen allgemeinen Algorithmus:flowchart TD\n    A[Start: Fahrstuhl wartet] --> B{Knopf außen gedrückt?}\n    B -->|Nein| B\n    B -->|Ja| C[Fahre zu der Etage mit dem Knopf]\n    C --> D[Öffne Tür]\n    D --> E{Person eingestiegen?}\n    E -->|Nein| E\n    E -->|Ja| F[Schließe Tür]\n    F --> G{Ziel-Knopf innen gedrückt?}\n    G -->|Nein| G\n    G -->|Ja| H[Fahre zur Ziel-Etage]\n    H --> I[Öffne Tür]\n    I --> J{Person ausgestiegen?}\n    J -->|Nein| J\n    J -->|Ja| K[Schließe Tür]\n    K --> A\n    \n    style A fill:#e1f5fe\n    style B fill:#fff3e0\n    style E fill:#fff3e0\n    style G fill:#fff3e0\n    style J fill:#fff3e0\n\nIn dem Flussdiagramm stehen die Rauten für Entscheidungen und die Rechtecke für\nAktionen. Der Pfeil zurück zum Start zeigt: Ein Fahrstuhl arbeitet in einer\nEndlosschleife und wartet kontinuierlich auf neue Anfragen.\n\nDie Beschreibung kann unterschiedlich detailliert sein. Zum Beispiel kann man\npräzisieren, wie lange die Tür geöffnet bleiben soll oder was passiert, wenn\ngleichzeitig andere Knöpfe gedrückt werden. Hier erkennt man: Ein Algorithmus\nkann sehr einfach beginnen, aber durch zusätzliche Fälle immer komplexer werden.\n\nMini-Übung\n\nÜberlegen Sie, welche zusätzlichen Regeln notwendig wären, wenn der Fahrstuhl\ngleichzeitig mehrere Anfragen erhält (z. B. jemand möchte in die 4. Etage und\njemand anders in die 2. Etage).\n\nLösung\n\nDer Fahrstuhl muss entscheiden, in welcher Reihenfolge die Stockwerke\nangefahren werden.\n\nMögliches Vorgehen: Immer in der aktuellen Fahrtrichtung alle Stockwerke\nbedienen, bevor gewendet wird.\n\nBeispiel: Wenn der Fahrstuhl im Erdgeschoss startet und Knöpfe für die 2. und\n4. Etage gedrückt sind, fährt er zuerst zur 2., dann zur 4. Etage.\n\nAuf die Idee, Alltagsprozesse in Form eines Algorithmus zu beschreiben, werden\nwir in späteren Kapiteln zurückkehren. Als nächstes beschäftigen wir uns damit,\nwie dem Computer solche Anweisungen in einer Programmiersprache erteilt werden.","type":"content","url":"/chapter01-sec01#algorithmus","position":5},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Programmiersprachen"},"type":"lvl2","url":"/chapter01-sec01#programmiersprachen","position":6},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Programmiersprachen"},"content":"Eine Programmiersprache ist eine formale Sprache, mit der sich\nDatenstrukturen und Algorithmen beschreiben lassen, sodass ein Computer diese\nAnweisungen ausführen kann.\n\nEs gibt nicht die eine wichtigste oder beste Programmiersprache. Welche\nSprache man verwendet, hängt immer von der Anwendung ab. Für ein\nSmartphone-Spiel wird eine andere Sprache gewählt als für die numerische\nSimulation in den Ingenieurwissenschaften. Einen Überblick über die Beliebtheit\nvon Programmiersprachen bietet der sogenannte Tiobe-Index:\n\nhttps://​www​.tiobe​.com​/tiobe​-index/\n\nMini-Übung\n\nRecherchieren Sie im Tiobe-Index nach den Programmiersprachen MATLAB und Python.\n\nAuf welchem Platz stehen die beiden Programmiersprachen aktuell?\n\nSchauen Sie sich auch die langfristige Entwicklung an. Wie haben sich beide\nSprachen in den letzten 10 Jahren entwickelt?\n\nLösung\n\nPython steht typischerweise in den Top 3, MATLAB meist zwischen Platz 15-20.\n\nPython zeigt seit Jahren einen deutlichen Aufwärtstrend, während MATLAB\nstagniert oder leicht rückläufig ist.\n\nBesonders für Ingenieurstudierende stellt sich oft die Frage: MATLAB oder\nPython? Während MATLAB traditionell in vielen technischen Fächern gelehrt wird,\nzeigt die Entwicklung der letzten Jahre einen klaren Trend zu Python. Dies liegt\nnicht nur an der größeren Vielseitigkeit, sondern auch daran, dass\nPython-Kenntnisse weit über die Ingenieurwissenschaften hinaus wertvoll sind.\n\nIn der Anfangszeit der Computer waren Programmiersprachen noch sehr nah an der\nMaschinensprache. Maschinensprache besteht aus Binärcode (Nullen und\nEinsen), den der Prozessor direkt ausführt. Hier ein Beispiel in Assembler,\neiner sehr maschinenorientierten Sprache, die bereits schwer lesbar ist:\n\n\n\nFigure 1:“Hallo Welt” in Assembler\n(Quelle: \n\nWikipedia → Assemblersprache)\n\nIn einer modernen Sprache wie Python ist der gleiche Code deutlich kürzer\nund leichter verständlich:\n\nprint('Hallo Welt')\n\n\n\nHeute arbeiten wir fast ausschließlich mit den sogenannten höheren\nProgrammiersprachen (wie Python, MATLAB oder C++), die für Menschen leichter\nverständlich sind. Damit Computer diese Anweisungen ausführen können, müssen sie\naber trotzdem in Maschinensprache übersetzt werden. Das geschieht auf zwei\nArten:\n\nCompiler-Sprachen: Der gesamte Code wird vorab in Maschinensprache\nübersetzt. Der Übersetzungsvorgang heißt Kompilieren.\n\nInterpreter-Sprachen: Der Code wird erst beim Ausführen Zeile für Zeile in\nMaschinensprache übersetzt. Der zeilenweise Ausführung wird Interpretieren\ngenannt.\n\nManchmal wird kompilierter Code als Programm und interpretierter Code als Skript\nbezeichnet. Im Alltag ist diese Unterscheidung aber nicht immer wichtig; oft\nsagt man zu beidem schlicht »Programm«.\n\nMini-Übung\n\nOrdnen Sie die folgenden Programmiersprachen zu: Sind sie kompiliert oder\ninterpretiert?\n\nC bzw. C++\n\nC# (ausgesprochen: C Sharp)\n\nJavaScript\n\nPython\n\nVisual Basic\n\nLösung\n\nC bzw. C++ → kompiliert\n\nC# → kompiliert\n\nJavaScript → interpretiert\n\nPython → interpretiert\n\nVisual Basic → kompiliert\n\nInsgesamt ist der Unterschied zwischen kompilierten und interpretierten Sprachen\nvor allem eine Frage der Geschwindigkeit und Flexibilität. Kompilierte Programme\nsind in der Regel schneller als interpretierte Programme, da der Maschinencode\ndirekt vom Betriebssystem ausgeführt werden kann. Umgekehrt können Änderungen\ndes Programms bei interpretierten Programmen schneller durchgeführt werden, da\ndiese ja ohnehin Zeile für Zeile abgearbeitet und interpretiert werden. Dies\nbedeutet, dass Änderungen am Code sofort wirksam werden, ohne dass eine erneute\nKompilierung erforderlich ist.\n\nLetztendlich hängt die Wahl der Programmiersprache von den Anforderungen des\nProjekts ab und davon, welche Kompromisse zwischen Geschwindigkeit und\nFlexibilität akzeptabel sind.","type":"content","url":"/chapter01-sec01#programmiersprachen","position":7},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Warum Python?"},"type":"lvl2","url":"/chapter01-sec01#warum-python","position":8},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Warum Python?"},"content":"Was ist überhaupt Python? Wikipedia beschreibt Python so:\n\n“Python ([ˈpʰaɪθn̩], [ˈpʰaɪθɑn], auf Deutsch auch [ˈpʰyːtɔn]) ist eine\nuniverselle, üblicherweise interpretierte, höhere Programmiersprache. Sie hat\nden Anspruch, einen gut lesbaren, knappen Programmierstil zu fördern. So\nwerden beispielsweise Blöcke nicht durch geschweifte Klammern, sondern durch\nEinrückungen strukturiert.”\n(Quelle: \n\nWikipedia)\n\nIn dieser Vorlesung verwenden wir Python als Programmiersprache, da Python viele\nVorteile für den Einstieg bietet:\n\nEinfache Syntax: Python hat eine klare und leicht verständliche Syntax, die\nes leicht macht, die Grundlagen der Programmierung zu erlernen. Die Syntax\nist lesbar und ähnelt der englischen Sprache, was das Verständnis\nerleichtert.\n\nVielseitigkeit: Python ist eine sehr vielseitige Programmiersprache, die in\nvielen verschiedenen Bereichen eingesetzt werden kann. Sie wird oft für\nDatenanalyse, künstliche Intelligenz, Webentwicklung und wissenschaftliches\nRechnen verwendet.\n\nGroße Community: Python hat eine große Community von Entwicklern, die aktiv\nan der Weiterentwicklung der Sprache und an der Bereitstellung von\nHilfestellung und Ressourcen für Anfänger beteiligt sind. Es gibt viele\nOnline-Foren, Kurse und Tutorials, die das Erlernen der Sprache erleichtern.\n\nInteraktiver Modus: Python bietet einen interaktiven Modus, der es\nAnfängern ermöglicht, Code Zeile für Zeile auszuführen und das Ergebnis\nsofort zu sehen. Dies macht das Experimentieren und die Suche nach Fehlern im\nCode sehr einfach und effektiv.\n\nPlattformunabhängigkeit: Python kann auf verschiedenen Betriebssystemen wie\nWindows, Mac und Linux ausgeführt werden.\n\nDas Erlernen einer Programmiersprache ist ein bisschen wie das Lernen einer\nFremdsprache: Die erste ist die schwierigste. Danach fällt der Umstieg auf\nandere Sprachen wesentlich leichter.","type":"content","url":"/chapter01-sec01#warum-python","position":9},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Zusammenfassung und Ausblick"},"type":"lvl2","url":"/chapter01-sec01#zusammenfassung-und-ausblick","position":10},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Zusammenfassung und Ausblick"},"content":"In diesem Kapitel haben wir die Vorteile des Programmierens für Ingenieure\ndiskutiert, den Begriff des Algorithmus anhand der Fahrstuhlsteuerung eingeführt\nund die Unterschiede zwischen verschiedenen Programmiersprachen erklärt.\nAußerdem haben wir gesehen, warum Python als erste Sprache besonders geeignet\nist. Im nächsten Kapitel beschäftigen wir uns mit den technischen\nVoraussetzungen, um eigene Python-Programme zu schreiben, und benutzen Python\nals Taschenrechner.","type":"content","url":"/chapter01-sec01#zusammenfassung-und-ausblick","position":11},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner"},"type":"lvl1","url":"/chapter01-sec02","position":0},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner"},"content":"In dieser Vorlesung werden wir das Python-Programmieren mit Hilfe von Jupyter\nNotebooks lernen. Daher klären wir zunächst, was Jupyter Notebooks sind, und\nverwenden anschließend Python als Taschenrechner. Ergebnisse von einfachen\nRechnungen lassen wir uns mit der print()-Funktion anzeigen.","type":"content","url":"/chapter01-sec02","position":1},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Lernziele"},"type":"lvl2","url":"/chapter01-sec02#lernziele","position":2},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Lernziele"},"content":"Lernziele\n\nSie wissen, was ein Jupyter Notebook ist.\n\nSie können Python als Taschenrechner benutzen.\n\nSie können Ergebnisse von Rechnungen mit print() anzeigen.\n\nSie wissen, was ein Argument einer Anweisung ist.","type":"content","url":"/chapter01-sec02#lernziele","position":3},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Was sind Jupyter Notebooks?"},"type":"lvl2","url":"/chapter01-sec02#was-sind-jupyter-notebooks","position":4},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Was sind Jupyter Notebooks?"},"content":"Jupyter Notebooks führen Text, Python-Code, Bilder und Videos in einem einzigen\ninteraktiven digitalen Notizbuch zusammen. Sie gehören zu den bekanntesten\nAnwendungen in der Programmierung und werden häufig für Datenanalyse,\nmaschinelles Lernen, Simulationen und Visualisierungen eingesetzt.\n\nEin Jupyter Notebook besteht aus einer Abfolge von Zellen, in denen Text,\nCode oder Grafiken eingebettet werden. Die Zellen können entweder in Python oder\nin anderen Programmiersprachen wie R, Julia oder JavaScript geschrieben sein.\nErkennbar sind Jupyter Notebooks an der Dateiendung .ipynb.\n\nDie Kombination von Text, Code und Visualisierungen macht Jupyter Notebooks zu\neinem besonders geeigneten Werkzeug für das Programmierenlernen: Konzepte\nwerden im Text erläutert und können direkt in Code-Zellen ausprobiert werden.\n\n\n\nFigure 1:Screenshot eines Jupyter Notebooks mit Text, Python-Code und Ergebnissen des\nausgeführten Python-Codes, das mit der “JupyterLab” geladen wurde (Quelle:\neigene Darstellung; Lizenz \n\nCC BY-NC-SA\n4.0)\n\nEine Zelle kann entweder eine Text-Zelle (siehe Screenshot, Schritt 1) oder eine\nCode-Zelle (siehe Screenshot, Schritt 2) sein. In Text-Zellen wird die\n\n\nMarkdown​-Formatierung\nverwendet. Um ein Wort fettgedruckt anzuzeigen, schreibt man zum Beispiel\n**fett**, was als fett dargestellt wird. In Code-Zellen (siehe Screenshot,\nSchritt 2 oder 3) können Sie direkt Python-Code eingeben. Eine Code-Zelle wird\nausgeführt, indem Sie auf “Run” klicken (siehe Screenshot, Schritt 4). Danach\nerscheint die Ausgabe, die der Python-Interpreter ggf. erzeugt (siehe\nScreenshot, Schritt 5). Ergebnisse werden mit “Out” gekennzeichnet.","type":"content","url":"/chapter01-sec02#was-sind-jupyter-notebooks","position":5},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Python als Taschenrechner"},"type":"lvl2","url":"/chapter01-sec02#python-als-taschenrechner","position":6},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Python als Taschenrechner"},"content":"Bevor wir in die Programmierung einsteigen, benutzen wir Python erst einmal als\nTaschenrechner. Im Folgenden sehen Sie, wie die Grundrechenarten in Python\nverwendet werden:\n\nAddition:\n\n2+3\n\n\n\nSubtraktion:\n\n2-3\n\n\n\nMultiplikation:\n\n2*4\n\n\n\nDivision:\n\n8/2\n\n\n\nPotenzierung:\n\n3**2\n\n\n\nSie können die obigen Code-Zellen verändern, zum Beispiel 2 + 3 in 2 + 5\nändern. So lernen Sie den Umgang mit Python-Anweisungen kennen.\n\nWenn Sie dieses Skript als interaktives Jupyter Notebook öffnen, können Sie\ndirekt in die Zellen klicken und den Code ändern. Falls Sie das Skript online\nlesen, klicken Sie bitte auf das Raketensymbol oben rechts und wählen „Live\nCode“, um interaktive Zellen zu aktivieren. Beim ersten Start kann dies etwas\ndauern.\n\nUm Übungen zu ermöglichen, enthalten manche Zellen nur einen Kommentar als\nPlatzhalter:\n\n# Geben Sie nach diesem Kommentar Ihren Code ein:\n\n\n\nAlles was nach dem Hashtag # steht, ist ein Kommentar. Kommentare werden von\nPython ignoriert und sind nur für uns Menschen gedacht.\n\nSelbstverständlich beherrscht Python auch Klammerregeln. Probieren Sie es aus!\n\nMini-Übung\n\nLassen Sie Python den Term 3\\cdot (7-10)+5 berechnen.\n\n# Geben Sie nach diesem Kommentar Ihren Code ein:\n\n\n\nLösung3 * (7-10) + 5","type":"content","url":"/chapter01-sec02#python-als-taschenrechner","position":7},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Ausgaben mit print"},"type":"lvl2","url":"/chapter01-sec02#ausgaben-mit-print","position":8},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Ausgaben mit print"},"content":"Bei den obigen Rechenaufgaben wurde automatisch das Ergebnis der Rechnung\nangezeigt, sobald die Code-Zelle ausgeführt wurde. Dies ist eine Besonderheit\nder Jupyter Notebooks. In einem normalen Python-Programm würde das nicht\nfunktionieren. Die interaktive Ausgabe der Jupyter Notebooks zeigt außerdem\nimmer nur das Ergebnis der letzten Zeile an.\n\nUm beliebige Ergebnisse oder Texte gezielt auszugeben, gibt es die\nprint()-Funktion.\n\nprint(2)\nprint(3+3)\n\n\n\nDas Argument wird in runde Klammern hinter den Funktionsnamen print\ngeschrieben. Ein Argument ist sozusagen der Input, der an die Funktion übergeben\nwird, damit Python weiß, welcher Wert auf dem Bildschirm angezeigt werden soll.\n\nDas zweite Beispiel in der zweiten Zeile funktioniert genauso. Nur wird diesmal\neine komplette Rechnung als Argument an die print()-Funktion übergeben. In dem\nFall rechnet der Python-Interpreter erst den Wert der Rechnung, also 3+3=6 aus\nund übergibt dann die 6 an die print()-Funktion. Die print()-Funktion\nwiederum zeigt dann die 6 am Bildschirm an.\n\nInsgesamt zeigt daher der Python-Interpreter erst eine 2 und dann in der\nnächsten Zeile eine 6 an.\n\nMini-Übung\n\nLassen Sie Python den Term 3:4 berechnen und geben Sie das Ergebnis mit der\nprint()-Funktion aus.\n\n# Geben Sie nach diesem Kommentar Ihren Code ein:\n\n\n\nLösungprint(3/4)\n\nAchtung: In Python wird für die Division / verwendet, nicht :. Das ist ein\nhäufiger Fehler.\n\nPython kann mit der print()-Funktion jedoch nicht nur Zahlen ausgeben, sondern\nauch Texte. Ein erster Versuch, einfach den Text als Argument der\nprint()-Funktion zu übergeben, scheitert leider, wie das nächste Beispiel zeigt.\n\n# Achtung, die nachfolgende Code-Zeile enthält einen Fehler!\nprint(Hallo)\n\n\n\nEs erscheint eine Fehlermeldung mit dem Fehler: NameError: name 'Hallo' is not defined. Der Grund hierfür ist, dass der Python-Interpreter versucht, eine\nsogenannte Variable oder eine Python-Anweisung mit dem Namen Hallo zu finden.\nDa es aber keines von beiden gibt, kommt die Fehlermeldung, dass Hallo nicht\ndefiniert wurde. Um den Text ausgeben zu lassen, werden um den Text einfache\noder doppelte Anführungszeichen gesetzt, wie in dem folgenden Beispiel.\n\nprint('Hallo')\n\n\n\nMini-Übung\n\nProbieren Sie aus was passiert, wenn Sie die einfachen Anführungszeichen '\ndurch doppelte Anführungszeichen \" ersetzen. Lassen Sie den Text Hallo Welt\nausgeben.\n\n# Geben Sie nach diesem Kommentar Ihren Code ein:\n\n\n\nLösungprint(\"Hallo Welt\")\n\nIn Python sind sowohl einfache als auch doppelte Anführungszeichen erlaubt.\nWenn ein Apostroph im Text vorkommt, sollten Sie doppelte Anführungszeichen\nverwenden.\n\nDie print()-Funktion kann noch viel mehr, als wir in dieser Einführung\ngesehen haben. Wir werden in einem späteren Kapitel im Zusammenhang mit den\nsogenannten f-Strings nochmal darauf zurückkommen.\n\nHinweis: Das folgende Video nutzt eine andere Entwicklungsumgebung (PyCharm) als\nwir in dieser Vorlesung. Wir nutzen die Entwicklungsumgebung JupyterLab. Die\ngrundlegenden Python-Befehle sind jedoch identisch. Fokussieren Sie sich ab\nMinute 9 auf die Python-Syntax, nicht auf die Bedienung der Software.\n\nVideo “Dein erstes Python-Programm” von Programmieren Starten","type":"content","url":"/chapter01-sec02#ausgaben-mit-print","position":9},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Zusammenfassung und Ausblick"},"type":"lvl2","url":"/chapter01-sec02#zusammenfassung-und-ausblick","position":10},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Zusammenfassung und Ausblick"},"content":"In diesem Kapitel haben wir Jupyter Notebooks kennengelernt, Python als\nTaschenrechner genutzt und die erste Python-Anweisung print() eingesetzt. Im\nnächsten Kapitel geht es um das Speichern von Daten und deren Verwaltung.","type":"content","url":"/chapter01-sec02#zusammenfassung-und-ausblick","position":11},{"hierarchy":{"lvl1":"Übungen"},"type":"lvl1","url":"/chapter01-sec03","position":0},{"hierarchy":{"lvl1":"Übungen"},"content":"Übung 1.1\n\nInstallieren Sie Anaconda auf Ihrem System. Starten Sie JupyterLab und erstellen\nSie ein neues Notebook. Bei Problemen konsultieren Sie die\nInstallationsanleitung.\n\nÜbung 1.2\n\nBenutzen Sie Python als Taschenrechner. Fügen Sie dazu diesem Jupyter Notebook\neine Code-Zelle hinzu und lassen Sie die folgenden Ausdrücke berechnen:\n\n2 + 3\n\n2 - 3\n\n4 * 5\n\n16 / 4\n\n16 / 3\n\n5**2\n\nLösungprint(2+3)\nprint(2-3)\nprint(4*5)\nprint(16/4)\nprint(16/3)\nprint(5**2)\n\nÜbung 1.3\n\nIn der vorhergehenden Aufgabe haben Sie den Ausdruck 5**2 berechnen lassen.\nFügen Sie jetzt eine Markdown-Zelle ein. Schreiben Sie auf, was Ihrer Vermutung\nnach der **-Operator für eine Bedeutung hat. Recherchieren Sie anschließend im\nInternet, nach seiner Bedeutung und vergleichen Sie Ihre Antwort mit der Recherche.\nFügen Sie die Internetseite als URL in die Markdown-Zelle ein.\n\nLösung\n\nDie beiden Sterne ** stehen für das Potenzieren. Eine kurze Beschreibung findet sich hier:\n[\n\nhttps://​www​.w3schools​.com​/python​/gloss​_python​_arithmetic​_operators​.asp]\n\nÜbung 1.4\n\nSpeichern Sie das bearbeitete Jupyter Notebook unter einem anderen Namen ab.\n\nLösung\n\nSehen Sie sich den folgenden Screencast an.\n\n\nÜbung 1.5\n\nProbieren Sie bewusst falsche Python-Anweisungen aus und beobachten Sie die\nFehlermeldungen.\n\nGeben Sie print(Hallo Welt) ein (ohne Anführungszeichen).\n\nVersuchen Sie 2 +* 3 (falsche Operatorenkombination).\n\nSchreiben Sie Print(5) (großes P) .\n\nNotieren Sie in einer Markdown-Zelle, welche Fehlermeldungen erscheinen und was\nsie bedeuten könnten.\n\nLösung\n\nprint(Hallo Welt) ohne Anführungszeichen führt zu der Fehlermeldung\nSyntaxError: invalid syntax. Syntax ist der Fachbegriff für die Grammatik\neiner Sprache. Diese Anweisung ist ungültig, weil Hallo Welt nicht als\nString gekennzeichnet wurde, also in Anführungszeichen gesetzt wurde.\n\nDie Anweisung 2 +* 3 führt ebenfalls zu einem Grammatikfehler, also\nSyntaxError: invalid syntax.\n\nDie Anweisung Print(5) führt zu einem Namensfehler NameError: name 'Print' is not defined. Python achtet penibel auf Groß- und Kleinschreibung. Den\nBefehl Print() mit einem großem P kennt Python daher nicht und meldet\ndeshalb den NameError.\n\nÜbung 1.6\n\nErstellen Sie eine Code-Zelle mit folgendem Inhalt:# Das ist ein Kommentar\nprint(7 + 3)  # Hier wird 7 + 3 berechnet\n# print(5 * 2)\nprint(8 - 2)\n\nFühren Sie die Zelle aus. Erklären Sie in einer Markdown-Zelle, warum manche\nZeilen ausgeführt werden und andere nicht.\n\nLösung\n\nEs werden nur die Zeilen ausgeführt, in denen kein Kommentarzeichen #\nsteht.\n\nÜbung 1.7\n\nBerechnen Sie folgende Ausdrücke und vergleichen Sie die Ergebnisse:\n\n2 + 3 * 4\n\n(2 + 3) * 4\n\n2**3*4\n\n2**(3*4)\n\nSchreiben Sie in eine Markdown-Zelle, welche Regeln Python für die Reihenfolge\nder Operationen befolgt.\n\nLösung\n\nEs gelten die folgenden Regeln für die Reihenfolge der Operationen:\n\nPunkt- vor Strichrechnung (als erst * und \\ vor + und -).\n\nKlammern werden immer zuerst berechnet.\n\nPotenzen werden vor +, -, *, \\ berechnet. Erst wird \n\n23 berechnet,\nwas 8 ergibt, und dann mit 4 multipliziert, so dass das Endergebnis 32 ist.\nDas Endergebnis ist nicht 2^{12} = 4096.\n\nKlammern werden weiterhin zuerst berechnet, also vor der Potenzierung\nausgewertet. Das Ergebnis ist 4096.\n\nÜbung 1.8\n\nExperimentieren Sie mit der print()-Funktion:\n\nprint(\"Mein Name ist\", \"Max\")\n\nprint(\"Das Ergebnis ist:\", 5*6)\n\nprint(2, 4, 6, 8)\n\nWas beobachten Sie, wenn print() mehrere Argumente erhält?\n\nLösung\n\nWerden der print()-Anweisung zwei Argumente übergeben, werden beide Argumente\nin einer Zeile angezeigt. Das Komma, das die beiden Argumente trennt, wird nicht\nausgegeben. Aus  print(\"Mein Name ist\", \"Max\") wird also der Text Mein Name ist Max. Das funktioniert auch bei Zahlen und sogar Rechnungen. Aus print(\"Das Ergebnis ist:\", 5*6) wird Das Ergebnis ist: 30.\n\nPython lässt in der print()-Funktion beliebig viele Argumente zu. Auch\nbeispielsweise vier Argumente wie in der Anweisung print(2, 4, 6, 8)\nfunktionieren, die Ausgabe ist 2 4 6 8.\n\nÜbung 1.9\n\nBerechnen Sie mit Python typische Ingenieursaufgaben, z.B.\n\nden Umfang eines Kreises mit Radius 5 cm (U = 2\\pi r, verwenden Sie \\pi\n\\approx 3.14159),\n\ndie Fläche eines Rechtecks mit Länge 12 m und Breite 8 m oder\n\ndie Geschwindigkeit eines Autos bei gleichförmiger Bewegung mit Weg 150 km in\nZeit 2.5 h.\n\nVerwenden Sie print() um die Ergebnisse mit beschreibendem Text auszugeben.\nWie kann Ihnen die vorherige Aufgabe dabei helfen?\n\nLösungprint('Der Umfang des Kreises mit r =', 5, 'ist', 2 * 5 * 3.14159, '.')\nprint('Die Fläche des Rechtecks mit Seite a =', 12, 'und Seite b =', 8, 'ist', 12*8, '.')\nprint('Die Geschwindigkeit ist', 150/2.5, 'km/h, wenn s =', 150, 'km und t =', 2.5, 'h .')","type":"content","url":"/chapter01-sec03","position":1},{"hierarchy":{"lvl1":"2.1 Datentypen und Variablen"},"type":"lvl1","url":"/chapter02-sec01","position":0},{"hierarchy":{"lvl1":"2.1 Datentypen und Variablen"},"content":"Mit Zahlen wird anders umgegangen, als mit Texten. Zahlen werden beispielsweise\naddiert, bei Texten werden beispielsweise Kleinbuchstaben durch Großbuchstaben\nersetzt. Daher ist es nicht verwunderlich, dass Python für beide Arten von\nInformationen eine andere technische Umsetzung verwendet. Das führt zu dem Thema\nDatentypen und dem Speichern von Informationen in Variablen.","type":"content","url":"/chapter02-sec01","position":1},{"hierarchy":{"lvl1":"2.1 Datentypen und Variablen","lvl2":"Lernziele"},"type":"lvl2","url":"/chapter02-sec01#lernziele","position":2},{"hierarchy":{"lvl1":"2.1 Datentypen und Variablen","lvl2":"Lernziele"},"content":"Lernziele\n\nSie wissen, was Datentypen sind.\n\nSie kennen den Unterschied zwischen Ganzzahlen und\nFließkommazahlen und die dazugehörigen Datentypen Integer und\nFloat.\n\nSie kennen den Datentyp String, der Zeichenketten repräsentiert.\n\nSie wissen, was eine Variable ist und wie sie erzeugt und gefüllt\nwird.","type":"content","url":"/chapter02-sec01#lernziele","position":3},{"hierarchy":{"lvl1":"2.1 Datentypen und Variablen","lvl2":"Datentypen in Python"},"type":"lvl2","url":"/chapter02-sec01#datentypen-in-python","position":4},{"hierarchy":{"lvl1":"2.1 Datentypen und Variablen","lvl2":"Datentypen in Python"},"content":"Der Computer kann Informationen nur als 0 oder 1 verarbeiten. Auf dem\nSpeichermedium oder im Speicher selbst werden Daten daher als eine Folge von 0\nund 1 gespeichert. Damit es für uns Programmiererinnen und Programmierer\neinfacher wird, Daten zu speichern und zu verarbeiten, wurden Datentypen\neingeführt.\n\nDatentypen fassen gleichartige Objekte zusammen und stellen passende\nOperationen zur Verfügung. Es hängt von der Programmiersprache ab, welche\nDatentypen zur Verfügung stehen, wie diese im Hintergrund gespeichert werden\nund welche Operationen damit möglich sind. In diesem Kapitel beschäftigen wir\nuns mit den einfachen Datentypen\n\nInteger\n\nFloat\n\nString","type":"content","url":"/chapter02-sec01#datentypen-in-python","position":5},{"hierarchy":{"lvl1":"2.1 Datentypen und Variablen","lvl3":"Zahlen (Integer und Floats)","lvl2":"Datentypen in Python"},"type":"lvl3","url":"/chapter02-sec01#zahlen-integer-und-floats","position":6},{"hierarchy":{"lvl1":"2.1 Datentypen und Variablen","lvl3":"Zahlen (Integer und Floats)","lvl2":"Datentypen in Python"},"content":"In der Programmierung unterscheidet man grundsätzlich zwischen zwei Zahlenarten,\nden Ganzzahlen und den Fließkommazahlen. Die Ganzzahlen werden in der\nMathematik als ganze Zahlen bezeichnet. In der Informatik wird meist der\nenglische Begriff Integer verwendet. Mit Integern können wir rechnen, d.h.\nOperationen ausführen. Einige davon haben wir ja bereits ausprobiert, als wir\nPython als Taschenrechner benutzt haben:\n\n2 * (3 + 4)\n\n\n\nSobald wir eine Division durchführen, die nicht aufgeht wie beispielsweise 1/2,\nverlassen wir den Bereich der ganzen Zahlen und kommen automatisch zu den\nrationalen Zahlen. Die rationalen Zahlen werden in der Informatik als\nFließkommazahl bzw. als Float bezeichnet. Python verwendet für das Ergebnis\neiner Division immer einen Float, unabhängig davon, ob die Division ganzzahlig\ndurchführbar wäre oder nicht, wie wir hier sehen:\n\n10/5\n\n\n\nHinweis: Das Dezimaltrennzeichen ist ein Punkt, nicht ein Komma wie im\nDeutschen. Aber ansonsten funktioniert alles wie erwartet:\n\n2.3 + 4.6\n\n\n\n1.4 - 5.2\n\n\n\n(-3.8) * 3.1\n\n\n\n2.4 / 0.3\n\n\n\n2.5**10\n\n\n\nMini-Übung\n\nEin zylindrischer Wassertank hat einen Radius von 1.5 m und eine Höhe von 4.0 m.\nBerechnen Sie sein Volumen mit der Formel V = \\pi \\cdot r^2 \\cdot h. Verwenden\nSie für die Kreiszahl \\pi die Näherung \\pi = 3.14159.\n\n# Code-Zelle\n\n\n\nLösung3.14159 * 1.5 * 1.5 * 4.0\n\nDas folgende Video fasst Zahlen in Python zusammen.\n\nVideo “Zahlen in Python” von Programmieren Starten","type":"content","url":"/chapter02-sec01#zahlen-integer-und-floats","position":7},{"hierarchy":{"lvl1":"2.1 Datentypen und Variablen","lvl3":"Strings","lvl2":"Datentypen in Python"},"type":"lvl3","url":"/chapter02-sec01#strings","position":8},{"hierarchy":{"lvl1":"2.1 Datentypen und Variablen","lvl3":"Strings","lvl2":"Datentypen in Python"},"content":"Daten sind aber sehr oft keine Zahlen. Beispielsweise könnte man sich\nvorstellen, eine Einkaufsliste zu erstellen und diese im Computer oder in einer\nNotiz-App auf dem Handy zu speichern. Eine solche Zeichenkette heißt in der\nInformatik String. Mit Zeichen meint man dabei Zahlen, Buchstaben oder\nandere Zeichen wie beispielsweise !\"§$%&/()=?.\n\nStrings werden in Python durch einfache oder doppelte Anführungszeichen definiert:\n\n\"Dies ist ein String!\"\n\n\n\nStrings haben wir beim Hallo-Welt-Programm schon kennengelernt. Allerdings haben\nwir zu diesem Zeitpunkt noch nicht den korrekten Fachbegriff String verwendet,\nsondern sie als Texte bezeichnet.\n\nWenn wir versuchen, zwei Strings zu addieren, passiert etwas Überraschendes.\n\n'2' + '2'\n\n\n\nDer +-Operator bewirkt bei Strings, dass sie zu einem neuen String verkettet\n(hintereinander gehängt) werden. Auch wenn das zunächst unerwartet ist, ist die\nVerkettung sehr nützlich, wenn wir einen String aus mehreren Strings\nzusammensetzen möchten:\n\nprint('Name: ' + 'Anna' + ' ' + 'Abendrot')\n\n\n\nAuf Strings und ihre Anwendungen kommen wir später noch zurück. Wenn Sie bereits\njetzt mehr erfahren wollen, können Sie sich folgendes Video ansehen.\n\nVideo “Strings in Python” von Programmieren Starten\n\nDie folgende Tabelle und das Video fassen die drei Datentypen Integer, Float und String\nübersichtsartig zusammen:\n\nDatentyp\n\nBeispiele\n\nTypische Operationen\n\nInteger\n\n42, -17, 0\n\n+, -, *, **\n\nFloat\n\n3.14, -0.5, 2.0\n\n+, -, *, /, **\n\nString\n\n\"Hallo\", 'Python'\n\n+ (Verkettung)\n\nVideo “Datentypen in Python” von Programmieren Starten","type":"content","url":"/chapter02-sec01#strings","position":9},{"hierarchy":{"lvl1":"2.1 Datentypen und Variablen","lvl2":"Variablen"},"type":"lvl2","url":"/chapter02-sec01#variablen","position":10},{"hierarchy":{"lvl1":"2.1 Datentypen und Variablen","lvl2":"Variablen"},"content":"Variablen sind beschriftete Schubladen. Oder anders formuliert sind\nVariablen Objekte, denen man einen Namen gibt. Technisch gesehen sind diese\nSchubladen ein kleiner Bereich im Arbeitsspeicher des Computers. Was in diesen\nSchubladen aufbewahrt wird, kann sehr unterschiedlich sein. Beispielsweise die\nTelefonnummer des ADAC-Pannendienstes, die 10. Nachkommastelle von \\pi oder die\naktuelle Position des Mauszeigers können in den Schubladen enthalten sein.\n\nWir verwenden Variablen, um bestimmte Werte oder ein bestimmtes Objekt zu\nspeichern. Eine Variable wird durch Zuweisung erzeugt. Damit meinen wir,\ndass eine Schublade angelegt wird und die Schublade dann erstmalig gefüllt wird.\nDas erstmalige Füllen der Schublade nennt man in der Informatik auch\nInitialisieren.\n\nx = 0.5\n\n\n\nSobald die Variable x in diesem Beispiel durch eine Zuweisung von 0.5 erstellt\nwurde, können wir sie verwenden:\n\nx * 3\n\n\n\nx + 17.8\n\n\n\nVariablen müssen initialisiert (erstmalig mit einem Wert versehen) werden, bevor\nsie verwendet werden können, sonst tritt ein Fehler auf.\n\nMini-Übung\n\nSpeichern Sie die Erdbeschleunigung 9.81 \\frac{\\text{m}}{\\text{s}^2} in einer\nVariable und berechnen Sie die Gewichtskraft eines 75 kg schweren Objekts mit\nFormel: F = m \\cdot g.\n\n# Code-Zelle\n\n\n\nLösungg = 9.81\n75 * g\n\nGerne können Sie sich auch folgendes Video auf YouTube ansehen, das eine\nEinführung in das Thema Variablen in Python gibt.\n\nVideo “Variablen in Python” von Programmieren Starten","type":"content","url":"/chapter02-sec01#variablen","position":11},{"hierarchy":{"lvl1":"2.1 Datentypen und Variablen","lvl2":"Richtlinien für Variablennamen"},"type":"lvl2","url":"/chapter02-sec01#richtlinien-f-r-variablennamen","position":12},{"hierarchy":{"lvl1":"2.1 Datentypen und Variablen","lvl2":"Richtlinien für Variablennamen"},"content":"Früher war der Speicherplatz von Computern klein, daher wurden häufig nur kurze\nVariablennamen wie beispielsweise i oder N verwendet. Heutzutage ist es\nStandard, nur in Ausnahmefällen (z.B. in Schleifen, dazu kommen wir noch) kurze\nVariablennamen zu nehmen. Stattdessen werden Namen benutzt, bei denen man\nerraten kann, was die Variable für einen Einsatzzweck hat. Beispielsweise lässt\nder Code\n\nm = 0.19\nn = 80\nb = n + m * n\nprint(b)\n\n\n\nnur schwer vermuten, was damit bezweckt wird. Oder können Sie erahnen, was dort\npassieren soll? Dagegen erahnt man bei diesem Code schon eher, was bezweckt\nwird:\n\nmehrwertsteuersatz = 19/100\nnettopreis = 80\nbruttopreis = nettopreis + mehrwertsteuersatz * nettopreis\nprint(bruttopreis)\n\n\n\nVerwenden Sie für Variablennamen nur ASCII-Zeichen, also keine Umlaute wie ö,\nü oder ß. Zahlen sind erlaubt, aber nicht am Anfang des Namens. Es ist\nsinnvoll, lange Variablen durch einen Unterstrich besser lesbar zu gestalten\n(sogenannte Snake-Case-Formatierung). Ich empfehle für Variablennamen\nbeispielsweise dateiname_alt oder dateiname_neu, wenn beispielsweise eine\nDatei umbenannt wird. Sie sind frei in der Gestaltung der Variablennamen,\nverboten sind nur die sogenannten Schlüsselwörter. Schlüsselwörter sind\nbeispielsweise eingebaute Kommandos für den Python-Interpreter wie if, for,\nwhile, def, class oder print. Würden Sie diese als Variablennamen\nbenutzen, wüsste der Python-Interpreter nicht, ob das Kommando oder die Variable\ngemeint ist.\n\nMini-Übung\n\nEin Elektromotor hat eine Leistung von 2500 Watt und läuft 8 Stunden pro Tag.\nBerechnen Sie den Energieverbrauch in Kilowattstunden (kWh) gemäß der Formel: E\n= P \\cdot t, wobei die Variablen folgende Bedeutung haben:\n\nVariable\n\nBedeutung\n\nEinheit\n\nE\n\nEnergieverbrauch\n\nkWh\n\nP\n\nLeistung\n\nkW\n\nt\n\nZeit\n\nh\n\nBeachten Sie, dass die Leistung in Watt zunächst in kW umgerechnet\nwerden muss.\n\n# Code-Zelle\n\n\n\nLösungleistung_watt = 2500\nleistung_kw = leistung_watt / 1000\nlaufzeit_stunden = 8\nenergie_kwh = leistung_kw * laufzeit_stunden\nprint(energie_kwh)","type":"content","url":"/chapter02-sec01#richtlinien-f-r-variablennamen","position":13},{"hierarchy":{"lvl1":"2.1 Datentypen und Variablen","lvl2":"Zusammenfassung und Ausblick"},"type":"lvl2","url":"/chapter02-sec01#zusammenfassung-und-ausblick","position":14},{"hierarchy":{"lvl1":"2.1 Datentypen und Variablen","lvl2":"Zusammenfassung und Ausblick"},"content":"In diesem Kapitel haben wir uns mit der Verarbeitung (Datentypen und Speichern\nvon Werten in Variablen) und der Ausgabe beschäftigt. Im nächsten Kapitel werden\nwir uns zusätzlich mit der Eingabe beschäftigen und so das komplette EVA-Prinzip\nvon datenverarbeitenden Systemen kennenlernen: Eingabe - Verarbeitung - Ausgabe.","type":"content","url":"/chapter02-sec01#zusammenfassung-und-ausblick","position":15},{"hierarchy":{"lvl1":"2.2 Benutzereingaben"},"type":"lvl1","url":"/chapter02-sec02","position":0},{"hierarchy":{"lvl1":"2.2 Benutzereingaben"},"content":"Ohne die Eingabe von Daten sind Apps wertlos. In diesem Kapitel beschäftigen wir\nuns daher mit einer direkten Eingabemöglichkeit in Python und lernen dazu die\ninput()-Funktion kennen. Um die input()-Funktion korrekt zu nutzen\nbeschäftigen wir uns mit Umwandlungen von Datentypen in andere Datentypen.\nZuletzt gehen wir noch auf die Stolperfalle ein, dass der Zuweisungsoperator =\nnicht die mathematische Gleichheit überprüft.","type":"content","url":"/chapter02-sec02","position":1},{"hierarchy":{"lvl1":"2.2 Benutzereingaben","lvl2":"Lernziele"},"type":"lvl2","url":"/chapter02-sec02#lernziele","position":2},{"hierarchy":{"lvl1":"2.2 Benutzereingaben","lvl2":"Lernziele"},"content":"Lernziele\n\nSie können das EVA-Prinzip erklären.\n\nSie können mit der input()-Funktion die Eingabe eines Benutzers abfragen\nund weiter verarbeiten.\n\nSie können per Typecasting Datentypen in andere Datentypen umwandeln.\n\nSie können mit der Funktion type() den Datentyp einer Variable\nermitteln.\n\nSie wissen, dass das Zeichen = ein Zuweisungsoperator ist und nicht für\ndie mathematische Gleichheit zweier Ausdrücke steht.","type":"content","url":"/chapter02-sec02#lernziele","position":3},{"hierarchy":{"lvl1":"2.2 Benutzereingaben","lvl2":"Ein- und Ausgabe sowie das EVA-Prinzip"},"type":"lvl2","url":"/chapter02-sec02#ein-und-ausgabe-sowie-das-eva-prinzip","position":4},{"hierarchy":{"lvl1":"2.2 Benutzereingaben","lvl2":"Ein- und Ausgabe sowie das EVA-Prinzip"},"content":"Grundlegend geht es bei der Datenverarbeitung und insbesondere bei der\nwissenschaftlichen Programmierung darum, Daten zu verarbeiten. Selbst bei einer\nSmartphone-App zum Spielen müssen Daten verarbeitet werden. Beispielsweise\nwerden das aktuelle Level oder die momentane Position des Gegners ausgewertet\nund gespeichert. Grundsätzlich folgen datenverarbeitende Systeme dem sogenannten\nEVA-Prinzip.\n\nWikipedia beschreibt das \n\nEVA-Prinzip wie folgt:\n\n“...Das EVA-Prinzip beschreibt ein Grundprinzip der Datenverarbeitung. Die\nAbkürzung leitet sich aus den ersten Buchstaben der Begriffe Eingabe,\nVerarbeitung und Ausgabe ab (englisch IPO model: input-process-output). Diese\ndrei Begriffe beschreiben die Reihenfolge, in der Daten verarbeitet werden.”\n\nTypische Eingabe-Operationen sind dabei\n\ndie Eingabe von Zeichen über eine Tastatur oder\n\ndas Lesen von Dateien, die auf der Festplatte oder einem Speichermedium gespeichert sind.\n\nHäufige Ausgabe-Operationen sind\n\ndie Wiedergabe von Texten, Zahlen oder Bildern auf dem Bildschirm oder\n\ndas Schreiben von Dateien auf Festplatte oder Speichermedium.\n\nMit der Ausgabe print() haben wir uns schon beschäftigt. Als nächstes geht es\num die Eingabe.","type":"content","url":"/chapter02-sec02#ein-und-ausgabe-sowie-das-eva-prinzip","position":5},{"hierarchy":{"lvl1":"2.2 Benutzereingaben","lvl2":"Die input()-Funktion"},"type":"lvl2","url":"/chapter02-sec02#die-input-funktion","position":6},{"hierarchy":{"lvl1":"2.2 Benutzereingaben","lvl2":"Die input()-Funktion"},"content":"Die einfachste und häufigste Eingabe erfolgt über die Tastatur. Die Funktion\ninput() stoppt das laufende Skript und erwartet eine Eingabe über die\nTastatur. Dabei wird der Text angezeigt, der zwischen den einfachen\nAnführungszeichen steht. Bei Python wird die Eingabe als String interpretiert.\nDie Eingabe wird mit der Taste Return/Enter abgeschlossen. Probieren wir es aus\n(dazu muss die Markdown-Zelle noch in eine Code-Zelle umgewandelt werden):input('Bitte geben Sie Ihren Namen ein: ')\n\nWir haben zwar jetzt auf Aufforderung einen Namen eingegeben, aber verarbeitet\nwurde diese Eingabe nicht. Es passierte einfach nichts. Um die Eingabe\nverarbeiten zu können, speichern wir sie zunächst in einer Variablen ab.x = input('Bitte geben Sie Ihren Namen ein: ')\n\nJetzt haben wir zwar den Namen in einer Variable gespeichert, aber so richtig\npassiert ist immer noch nichts. Jetzt wäre es noch schön, wenn wir den Benutzer\noder die Benutzerin unseres Skripts begrüßen können und einen entsprechenden Text\nanzeigen lassen können. Dazu verwenden wir erneut die print()-Funktion.print('Hallo')\n\nJetzt können wir alles zusammensetzen.# Eingabe\nx = input('Bitte geben Sie Ihren Namen ein: ')\n\n# Ausgabe\nprint('Hallo ' + x)\n\nKopieren Sie diesen Code in die nächste Code-Zelle und probieren Sie es aus!\n\n# Code-Zelle\n\n\n\nMini-Übung\n\nSchreiben Sie ein Programm, das nach Ihrem Lieblingsgericht fragt und dann\nausgibt: “Ihr Lieblingsgericht ist: [Eingabe]”.\n\n# Code-Zelle\n\n\n\nLösung# Eingabe\nlieblingsgericht = input('Was ist Ihr Lieblingsgericht? ')\n\n# Ausgabe\nprint('Ihr Lieblingsgericht ist ' + lieblingsgericht)\n\nIn dem folgenden Video sehen Sie weitere Erläuterungen zur input()-Funktion.\n\nVideo “Die input()-Funktion” von Programmieren Starten","type":"content","url":"/chapter02-sec02#die-input-funktion","position":7},{"hierarchy":{"lvl1":"2.2 Benutzereingaben","lvl2":"Umwandlung von Datentypen"},"type":"lvl2","url":"/chapter02-sec02#umwandlung-von-datentypen","position":8},{"hierarchy":{"lvl1":"2.2 Benutzereingaben","lvl2":"Umwandlung von Datentypen"},"content":"Die input()-Funktion hat eine Einschränkung. Bei ihrer Einführung wurde in\neinem Nebensatz erwähnt, dass die input()-Funktion Strings zurückgibt. Python\nkann bei der Eingabe nicht wissen, ob wir eine Zahl oder Text eingeben möchten,\ndaher wird alles als Text (String) behandelt. Das ist eine häufige Fehlerquelle\nin der Programmierung, wenn man nach Zahlen fragt. Glücklicherweise gibt es\ndafür eine einfache Lösung. Wir können einen String in einen Integer oder Float\numwandeln, indem wir die Funktionen int() oder float() benutzen. Wenn also\nnach einer Zahl gefragt werden soll wie beispielsweise dem Alter einer Person,\nso lautet der Code wie folgt:# Eingabe: input() liefert String\nantwort = input('Wie alt sind Sie?') \n\n# Verarbeitung: Umwandlung in einen Integer  \nzahl = int(antwort)\n\n# Ausgabe                \nprint('Alter: ', zahl)                \n\nUnd soll es eine Fließkommazahl werden, können wir folgendermaßen vorgehen:# Eingabe: input() liefert String\nantwort = input('Wie groß sind Sie gemessen in Metern?')\n\n# Verarbeitung: Umwandlung in einen Float\nzahl = float(antwort)\n\n# Ausgabe    \nprint('Größe in m', zahl)\n\nProbieren Sie gerne beide Varianten in der nächsten Code-Zelle aus.\n\n# Code-Zelle\n\n\n\nWarnung\n\nWenn Sie bei int() oder float() keine gültige Zahl eingeben, meldet Python\neinen Fehler (ValueError). Geben Sie also bei der Abfrage nach dem Alter\nwirklich eine Zahl ein!\n\nMöchten wir Zahlen mit ihrer Einheit ausgeben, können wir umgekehrt die Zahl in\neinen String umwandeln, indem wir str() benutzen.\n\ng = 9.81\nprint('Die Erdbeschleunigung g = ' + str(g) + 'm/s^2.')\n\n\n\nMini-Übung\n\nSchreiben Sie ein Programm, das nach einer Temperatur in Grad Celsius fragt und\ndiese in Kelvin umrechnet. Formel: K = C + 273.15\n\nBeispiel: Eingabe 20 ==> Ausgabe “20.0°C entspricht 293.15 K”\n\n# Code-Zelle\n\n\n\nLösung# Eingabe\ntemperatur_C = float(input('Geben Sie die Temperatur in Grad Celsius an: '))\n\n# Verarbeitung\ntemperatur_K = temperatur_C + 273.15\n\n# Ausgabe\nprint(str(temperatur_C) + '°C entspricht ' + str(temperatur_K) + ' K.')\n\nIn den bisher betrachteten Beispielen sind die Python-Programme ein bis zwei\nZeilen lang. Unwahrscheinlich, dass dann nicht klar ist, welchen Datentyp eine\nVariable hat. Wenn aber später die Programme länger werden und vielleicht auch\nBenutzereingaben dazu kommen, kann man auch den Überblick darüber verlieren,\nwelcher Datentyp aktuell in einer bestimmten Variable gespeichert ist. Dafür\ngibt es die type()-Funktion.\n\ndatentyp = type(3)\nprint(datentyp)\n\ndatentyp = type(3.1)\nprint(datentyp)\n\ndatentyp = type('Hallo')\nprint(datentyp)\n\n\n\nMehr über das sogenannte Type-Casting, also das Umwandeln von einen Datentyp in\neinen anderen, erfahren wir in diesem Video.\n\nVideo “Type-Casting in Python” von Programmieren Starten","type":"content","url":"/chapter02-sec02#umwandlung-von-datentypen","position":9},{"hierarchy":{"lvl1":"2.2 Benutzereingaben","lvl2":"Zuweisungsoperator"},"type":"lvl2","url":"/chapter02-sec02#zuweisungsoperator","position":10},{"hierarchy":{"lvl1":"2.2 Benutzereingaben","lvl2":"Zuweisungsoperator"},"content":"Wichtig ist, dass das = in der Informatik eine andere Bedeutung hat als in der\nMathematik. = meint nicht das Gleichheitszeichen, sondern den sogenannten\nZuweisungsoperator. Das ist in der Programmierung ein Kommando, das eine\nSchublade befüllt oder technischer ausgedrückt, ein Objekt einer Variable\nzuweist.\n\nSehr häufig findet man Code wiex = x + 1\n\nWürden wir dies als Gleichung lesen, wie wir es aus der Mathematik gewohnt sind,\nalso x = x+1, könnten wir x auf beiden Seiten subtrahieren und erhalten\n0=1. Wir wissen, dass dies nicht wahr ist, also stimmt hier etwas nicht.\n\nIn Python sind “Gleichungen” keine mathematischen Gleichungen, sondern\nZuweisungen. “=” ist kein Gleichheitszeichen im mathematischen Sinne, sondern\neine Zuweisung. Die Zuweisung muss immer in der folgenden Weise zweistufig\ngelesen werden:\n\nBerechne den Wert auf der rechten Seite (also x+1).\n\nWeise den Wert auf der rechten Seite dem auf der linken Seite stehenden\nVariablennamen zu.\n\nWir probieren eine solche Zuweisung in der folgenden Code-Zelle aus und benutzen\nauch gleich die print()-Funktion, um den Wert der Variablen x ausgeben zu\nlassen:\n\nx = 4     \nx = x + 1\nprint(x)\n\n\n\nMini-Übung\n\nFühren Sie folgenden Code Schritt für Schritt aus und notieren Sie nach jeder\nZeile den Wert von x:x = 10\nx = x + 5\nx = x * 2\nx = x - 3\nprint(x)\n\nWas ist der finale Wert von x?\n\n# Code-Zelle\n\n\n\nLösung\n\nDer finale Wert von x ist 27.\n\nDer Zuweisungsoperator ist äußerst wichtig in der Python-Programmierung. Daher\nempfehle ich Ihnen folgendes Video.\n\nVideo “Der Zuweisungsoperator” von Programmieren Starten","type":"content","url":"/chapter02-sec02#zuweisungsoperator","position":11},{"hierarchy":{"lvl1":"2.2 Benutzereingaben","lvl2":"Zusammenfassung und Ausblick"},"type":"lvl2","url":"/chapter02-sec02#zusammenfassung-und-ausblick","position":12},{"hierarchy":{"lvl1":"2.2 Benutzereingaben","lvl2":"Zusammenfassung und Ausblick"},"content":"Das EVA-Prinzip ist das grundlegende Prinzip der Datenverarbeitung. Mit den\nPython-Funktionen input() und print() und den Datentypen Integer, Float und\nString haben wir bereits die wichtigsten Bausteine zusammen, um kleine\nPython-Programme zu schreiben.","type":"content","url":"/chapter02-sec02#zusammenfassung-und-ausblick","position":13},{"hierarchy":{"lvl1":"Übungen"},"type":"lvl1","url":"/chapter02-sec03","position":0},{"hierarchy":{"lvl1":"Übungen"},"content":"Übung 2.1\n\nBetrachten Sie die folgenden beiden Code-Zeilen:print(5 + 3)\nprint('5' + '3')\n\nSagen Sie vorher, was jeweils ausgegeben wird.\n\nFühren Sie den Code in der nächsten Code-Zelle aus und überprüfen Sie Ihre\nVorhersage.\n\nErklären Sie, warum die Ausgaben unterschiedlich sind.\n\n# Code-Zelle\n\n\n\nLösung\n\nVorhersage\n\nprint(5 + 3) gibt 8 aus\n\nprint('5' + '3') gibt 53 aus\n\nAusführung Beim Ausführen des Codes sehen Sie genau diese Ausgaben.\n\nErklärung\n\nIn der ersten Zeile werden zwei Integer (Ganzzahlen) addiert. Der\n+-Operator führt eine mathematische Addition durch: 5 + 3 = 8\n\nIn der zweiten Zeile werden zwei Strings (Zeichenketten) verkettet. Die\nAnführungszeichen machen aus den Zahlen Texte. Der +-Operator hängt bei\nStrings die Zeichenketten hintereinander: ‘5’ + ‘3’ = ‘53’\n\nWichtige Erkenntnis: Der Datentyp bestimmt, wie Operationen durchgeführt werden.\nDerselbe Operator (+) verhält sich bei Zahlen und Strings völlig\nunterschiedlich!\n\nÜbung 2.2\n\nEin Stahlträger hat eine Länge von 3.5 m und wiegt pro Meter 25.4 kg.\n\nSpeichern Sie die Länge in einer Variable laenge und das Gewicht pro Meter\nin einer Variable gewicht_pro_meter.\n\nBerechnen Sie das Gesamtgewicht des Trägers mit der Formel: Gesamtgewicht =\nLänge · Gewicht pro Meter.\n\nGeben Sie das Ergebnis mit print() aus.\n\n# Code-Zelle\n\n\n\nLösung# Variablen initialisieren\nlaenge = 3.5\ngewicht_pro_meter = 25.4\n\n# Berechnung\ngesamtgewicht = laenge * gewicht_pro_meter\n\n# Ausgabe\nprint(gesamtgewicht)\n\nAlternative Ausgabe mit Text und Einheit:print('Das Gesamtgewicht beträgt', gesamtgewicht, 'kg')\n\nDas Ergebnis ist 88.9 kg.\n\nÜbung 2.3\n\nGegeben sind folgende Variablen für ein Bauteil:bauteil_typ = \"Schraube\"\nmaterial = \"Edelstahl\"\nnorm = \"DIN 933\"\ndurchmesser = \"M8\"\n\nVerketten Sie diese vier Strings mit dem +-Operator zu einem vollständigen\nSatz nach folgendem Muster: Bauteil: [Typ], Material: [Material], Norm: [Norm], Durchmesser: [Durchmesser]\n\nGeben Sie den zusammengesetzten String mit print() aus.\n\nTipp: Vergessen Sie nicht die Leerzeichen und Kommas zwischen den Textteilen!\n\n# Code-Zelle\n\n\n\nLösung# gegebene Variablen\nbauteil_typ = \"Schraube\"\nmaterial = \"Edelstahl\"\nnorm = \"DIN 933\"\ndurchmesser = \"M8\"\n\n# String-Verkettung\nbeschreibung = \"Bauteil: \" + bauteil_typ + \", Material: \" + material + \", Norm: \" + norm + \", Durchmesser: \" + durchmesser\n\n# Ausgabe\nprint(beschreibung)\n\nAlternative kürzere Lösung (direkt in print()):print(\"Bauteil: \" + bauteil_typ + \", Material: \" + material + \", Norm: \" + norm + \", Durchmesser: \" + durchmesser)\n\nÜbung 2.4\n\nSchreiben Sie ein Programm, das nacheinander nach folgenden Informationen fragt:\n\nVorname\n\nStudiengang\n\nLieblingsfach\n\nDas Programm soll anschließend einen vollständigen Satz ausgeben: “Hallo\n[Vorname], du studierst [Studiengang] und dein Lieblingsfach ist\n[Lieblingsfach].”\n\nHinweis: Verwenden Sie die input()-Funktion und String-Verkettung mit +.\n\n# Code-Zelle\n\n\n\nLösung# Eingabe\nvorname = input('Wie ist dein Vorname? ')\nstudiengang = input('Was studierst du? ')\nlieblingsfach = input('Was ist dein Lieblingsfach? ')\n\n# Ausgabe\nprint('Hallo ' + vorname + ', du studierst ' + studiengang + ' und dein Lieblingsfach ist ' + lieblingsfach + '.')\n\nBeispiel-Ausgabe: Wenn die Eingaben “Anna”, “Maschinenbau” und\n“Werkstofftechnik” sind, lautet die Ausgabe:Hallo Anna, du studierst Maschinenbau und dein Lieblingsfach ist Werkstofftechnik.\n\nÜbung 2.5\n\nSchreiben Sie ein Programm, das die Fläche eines rechteckigen Bauteils\nberechnet.\n\nFragen Sie nach der Länge des Bauteils in Metern.\n\nFragen Sie nach der Breite des Bauteils in Metern.\n\nBerechnen Sie die Fläche mit der Formel: Fläche = Länge · Breite.\n\nGeben Sie das Ergebnis aus: “Die Fläche beträgt [Ergebnis] m^2.”\n\nHinweis: Verwenden Sie float(), um die Eingaben in Fließkommazahlen\numzuwandeln, und str(), um die berechnete Fläche in der Ausgabe einzufügen.\n\n# Code-Zelle\n\n\n\nLösung# Eingabe\nlaenge = float(input('Geben Sie die Länge in Metern ein: '))\nbreite = float(input('Geben Sie die Breite in Metern ein: '))\n\n# Verarbeitung\nflaeche = laenge * breite\n\n# Ausgabe\nprint('Die Fläche beträgt ' + str(flaeche) + ' m^2.')\n\nBeispiel-Ausgabe:\nBei Eingaben 3.5 und 2.4 lautet die Ausgabe:Die Fläche beträgt 8.4 m^2.\n\nÜbung 2.6\n\nGegeben ist folgende Liste von Variablennamen:\n\ntemperatur_celsius\n\n3messung\n\nKraft-Newton\n\nx\n\ngeschwindigkeit_m_pro_s\n\nlänge\n\nprint\n\nMeineVariable\n\na\n\nquerschnittsflaeche_m2\n\nAnalysieren Sie jeden Variablennamen und entscheiden Sie:\n\nungültig: Welche Namen sind in Python nicht erlaubt? Begründen Sie, warum.\n\nungeschickt: Welche Namen sind zwar erlaubt, aber in der Praxis schlecht\ngewählt? Begründen Sie, warum.\n\ngut: Welche Namen sind empfehlenswert?\n\nHinweis: Denken Sie an die Regeln, d.h. keine Zahlen am Anfang, keine Umlaute,\nkeine Bindestriche, keine Schlüsselwörter, aussagekräftige Namen bevorzugen.\n\nLösung\n\nVariablenname\n\nEinordnung\n\nBegründung\n\ntemperatur_celsius\n\ngut\n\naussagekräftig, snake_case, mit Einheit\n\n3messung\n\nungültig\n\nVariable beginnt mit einer Zahl; korrekt: messung3 oder messung_3\n\nKraft-Newton\n\nungültig\n\nBindestrich (Minus-Zeichen) ist nicht erlaubt; korrekt: kraft_newton\n\nx\n\nungeschickt\n\nzu kurz, nicht aussagekräftig; nur in sehr kurzen Programmen akzeptabel\n\ngeschwindigkeit_m_pro_s\n\ngut\n\nsehr aussagekräftig, snake_case, enthält Einheit\n\nlänge\n\nungültig\n\nUmlaut ist nicht erlaubt; korrekt: laenge\n\nprint\n\nungültig\n\nSchlüsselwort von Python, darf nicht als Variablenname verwendet werden\n\nMeineVariable\n\nungeschickt\n\nverwendet UpperCamelCase statt snake_case (empfohlen für Python-Variablen)\n\na\n\nungeschickt\n\nzu kurz, nicht aussagekräftig\n\nquerschnittsflaeche_m2\n\ngut\n\naussagekräftig, snake_case, mit Einheit (m2 für m²)\n\nÜbung 2.7\n\nGegeben ist folgender Code:spannung = 230\nspannung = spannung * 2\nspannung = spannung - 100\nspannung = spannung / 3\nprint(spannung)\n\nFühren Sie den Code gedanklich Schritt für Schritt aus und notieren Sie\nnach jeder Zeile den aktuellen Wert der Variable spannung.\n\nErstellen Sie eine Tabelle mit zwei Spalten: “nach Zeile” und “Wert von\nspannung”\n\nFühren Sie den Code anschließend in der Code-Zelle aus und überprüfen Sie\nIhre Vorhersage.\n\nHinweis: Denken Sie daran, dass der Zuweisungsoperator = in zwei Schritten\narbeitet: Erst wird die rechte Seite berechnet, dann wird das Ergebnis der\nVariable auf der linken Seite zugewiesen.\n\n# Code-Zelle\n\n\n\nLösung\n\nSchrittweise Ausführung:\n\nnach Zeile\n\nWert von spannung\n\nBerechnung\n\nspannung = 230\n\n230\n\nInitialisierung\n\nspannung = spannung * 2\n\n460\n\n230 * 2 = 460\n\nspannung = spannung - 100\n\n360\n\n460 - 100 = 360\n\nspannung = spannung / 3\n\n120.0\n\n360 / 3 = 120.0\n\nEndergebnis: 120.0\n\nErklärung: Der Zuweisungsoperator arbeitet immer nach dem gleichen Prinzip:\n\nBerechne den Wert auf der rechten Seite (dabei wird der alte Wert der\nVariable verwendet).\n\nWeise das Ergebnis der Variable auf der linken Seite zu (überschreibt den\nalten Wert).\n\nBeachten Sie: Das Ergebnis ist 120.0 (Float), nicht 120 (Integer), weil die\nDivision / in Python immer ein Float-Ergebnis liefert.\n\nÜbung 2.8\n\nEin Fahrzeug beschleunigt gleichmäßig. Die Geschwindigkeit nach einer bestimmten\nZeit kann mit folgender Formel berechnet werden:v = v_0 + a \\cdot t,\n\nwobei\n\nv = Endgeschwindigkeit in m/s,\n\nv_0 = Anfangsgeschwindigkeit in m/s,\n\na = Beschleunigung in m/s²,\n\nt = Zeit in s.\n\nSchreiben Sie ein vollständiges Programm, das\n\nnach der Anfangsgeschwindigkeit v_0 fragt (in m/s),\n\nnach der Beschleunigung a fragt (in m/s²),\n\nnach der Zeit t fragt (in s),\n\ndie Endgeschwindigkeit berechnet und\n\ndas Ergebnis ausgibt: “Nach [Zeit] Sekunden beträgt die Geschwindigkeit\n[Ergebnis] m/s”.\n\nWichtig: Strukturieren Sie Ihren Code mit Kommentaren nach dem EVA-Prinzip:\n\n# Eingabe\n\n# Verarbeitung\n\n# Ausgabe\n\nVerwenden Sie aussagekräftige Variablennamen!\n\n# Code-Zelle\n\n\n\nLösung# Eingabe\nanfangsgeschwindigkeit = float(input('Geben Sie die Anfangsgeschwindigkeit v0 in m/s ein: '))\nbeschleunigung = float(input('Geben Sie die Beschleunigung a in m/s² ein: '))\nzeit = float(input('Geben Sie die Zeit t in Sekunden ein: '))\n\n# Verarbeitung\nendgeschwindigkeit = anfangsgeschwindigkeit + beschleunigung * zeit\n\n# Ausgabe\nprint('Nach ' + str(zeit) + ' Sekunden beträgt die Geschwindigkeit ' + str(endgeschwindigkeit) + ' m/s.')\n\nBeispiel-Ausgabe:\nBei Eingaben v_0 = 10, a = 2.5, t = 4 lautet die Ausgabe:Nach 4.0 Sekunden beträgt die Geschwindigkeit 20.0 m/s.\n\nÜbung 2.9\n\nDer folgende Code soll eine Länge von Zoll in Zentimeter umrechnen (1 Zoll =\n2.54 cm). Allerdings enthält der Code mehrere Fehler und funktioniert nicht\nkorrekt.# Fehlerhafter Code\nzoll = input('Geben Sie die Länge in Zoll ein: ')\nzentimeter = zoll * 2.54\nprint('Das entspricht ' + zentimeter + ' cm.')\n\nIhre Aufgabe:\n\nKopieren Sie den Code in die Code-Zelle und führen Sie ihn aus. Welche\nFehlermeldung erhalten Sie?\n\nFügen Sie nach der Eingabezeile print(type(zoll)) ein, um den Datentyp zu\nüberprüfen.\n\nIdentifizieren Sie alle Fehler im Code.\n\nKorrigieren Sie den Code, sodass er korrekt funktioniert.\n\nTipp: Es gibt zwei Stellen, an denen Typkonvertierungen fehlen!\n\n# Code-Zelle für Fehleranalyse\n\n\n\n# Code-Zelle für korrigierten Code\n\n\n\nLösung\n\nFehleranalyse: Die erste Fehlermeldung beim Ausführen ist ein TypeError: can't multiply sequence by non-int of type 'float', weil versucht wird, einen\nString mit einer Fließkommazahl zu multiplizieren.\n\nDatentyp überprüfen: Mit type(zoll) stellen wir fest: <class 'str'>\n(sollte float sein).\n\nIdentifizierte Fehler:\n\nzoll = input(...): Rückgabe von input() ist String, muss in Float umgewandelt werden.\n\nprint(... + zentimeter + ...): zentimeter ist Float, muss für String-Verkettung in String umgewandelt werden.\n\nKorrigierter Code:# Eingabe\nzoll = float(input('Geben Sie die Länge in Zoll ein: '))\n\n# Verarbeitung\nzentimeter = zoll * 2.54\n\n# Ausgabe\nprint('Das entspricht ' + str(zentimeter) + ' cm.')\n\nBeispiel-Ausgabe: Bei Eingabe 10 Zoll:Das entspricht 25.4 cm.\n\nÜbung 10 (Mini-Projekt)\n\nSie sollen einen Rechner entwickeln, der für ein quaderförmiges Stahlbauteil das\nVolumen, das Gewicht und die Materialkosten berechnet.\n\nBenötigte Formeln:\n\nVolumen: V = Länge · Breite · Höhe (in m³)\n\nGewicht: m = V · ρ (in kg), wobei ρ die Dichte ist\n\nKosten: K = m · Preis (in €)\n\nIhr Programm soll\n\nnach folgenden Werten fragen:\n\nLänge des Bauteils in Metern,\n\nBreite des Bauteils in Metern,\n\nHöhe des Bauteils in Metern,\n\nDichte von Stahl in kg/m³ (typisch: 7850 kg/m³),\n\nPreis pro Kilogramm in € (typisch: 2-5 €/kg).\n\nDas Volumen, das Gewicht und die Gesamtkosten berechnen.\n\nAlle Ergebnisse übersichtlich ausgeben:\n\n“Volumen: [Wert] m^3”\n\n“Gewicht: [Wert] kg”\n\n“Materialkosten: [Wert] EUR”\n\nAnforderungen:\n\nVerwenden Sie aussagekräftige Variablennamen.\n\nStrukturieren Sie Ihren Code mit Kommentaren nach dem EVA-Prinzip.\n\nVerwenden Sie Zwischenvariablen für die Berechnungsergebnisse.\n\nAchten Sie auf korrekte Typkonvertierungen.\n\nTesten Sie Ihr Programm mit einem Beispiel: Länge = 2.0 m, Breite = 0.5 m, Höhe\n= 0.3 m, Dichte = 7850 kg/m³, Preis = 3.50 €/kg.\n\n# Code-Zelle\n\n\n\nLösung# Eingabe\nlaenge = float(input('Geben Sie die Länge des Bauteils in Metern ein: '))\nbreite = float(input('Geben Sie die Breite des Bauteils in Metern ein: '))\nhoehe = float(input('Geben Sie die Höhe des Bauteils in Metern ein: '))\ndichte_stahl = float(input('Geben Sie die Dichte von Stahl in kg/m³ ein: '))\npreis_pro_kg = float(input('Geben Sie den Preis pro Kilogramm in € ein: '))\n\n# Verarbeitung\nvolumen_m3 = laenge * breite * hoehe\ngewicht_kg = volumen_m3 * dichte_stahl\nmaterialkosten_euro = gewicht_kg * preis_pro_kg\n\n# Ausgabe\nprint('Volumen: ' + str(volumen_m3) + ' m^3')\nprint('Gewicht: ' + str(gewicht_kg) + ' kg')\nprint('Materialkosten: ' + str(materialkosten_euro) + ' EUR')\n\nBeispiel-Ausgabe (mit den Testwerten: 2.0, 0.5, 0.3, 7850, 3.50):Volumen: 0.3 m^3\nGewicht: 2355.0 kg\nMaterialkosten: 8242.5 EUR","type":"content","url":"/chapter02-sec03","position":1},{"hierarchy":{"lvl1":"Willkommen zu meinem Vorlesungsskript Python"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Willkommen zu meinem Vorlesungsskript Python"},"content":"TH Mannheim markdownlint-disable MD001 ","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Willkommen zu meinem Vorlesungsskript Python","lvl2":"Vorlesungsskript Python"},"type":"lvl2","url":"/#vorlesungsskript-python","position":2},{"hierarchy":{"lvl1":"Willkommen zu meinem Vorlesungsskript Python","lvl2":"Vorlesungsskript Python"},"content":" markdownlint-enable MD001 \n\nDie Digitalisierung in den Ingenieurwissenschaften nimmt zu. Daher bietet dieser\nPython-Kurs zukünftigen Ingenieurinnen und Ingenieuren einen Einstieg in die\ngrundlegenden Programmiertechniken mit Python. Jedes Kapitel entspricht dabei\neiner Vorlesung mit integrierten Übungen von 90 min Dauer. Weitere Übungen\ndienen der Vertiefung der gelernten Inhalte im Selbststudium.","type":"content","url":"/#vorlesungsskript-python","position":3},{"hierarchy":{"lvl1":"Inhaltsverzeichnis"},"type":"lvl1","url":"/toc","position":0},{"hierarchy":{"lvl1":"Inhaltsverzeichnis"},"content":"Python\n\nInhaltsverzeichnis\n\n1. Grundlagen und erste Schritte\n\n1.1 Algorithmus und Programmiersprachen\n\n1.2 Jupyter Notebooks und Python als Taschenrechner\n\nÜbungen\n\n2. Daten speichern und verwalten\n\n2.1 Datentypen und Variablen\n\n2.2 Benutzereingaben\n\nÜbungen","type":"content","url":"/toc","position":1}]}