{"version":"1","records":[{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen"},"type":"lvl1","url":"/chapter01-sec01","position":0},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen"},"content":"Es gibt viele Gründe, warum es sich lohnt, Programmieren zu lernen. Die\nNachfrage nach Ingenieurinnen und Ingenieuren, die zusätzlich Programmieren\nkönnen, wächst aufgrund der Digitalisierung der Industrie rasant. Programmieren\nfördert kritisches Denken und Problemlösungsfähigkeiten. Umgekehrt werden durch\nProgrammieren diese Fähigkeiten weiter entwickelt. Zudem fördert Programmieren\ndas Verständnis von Technologie und Computersystemen. Es kann helfen, die\nFunktionsweise von Software und Hardware besser zu verstehen und Einblicke in\ndie Arbeitsweise von Websites, Anwendungen und anderen Technologien zu gewinnen.\nProgrammierung kann auch dabei helfen, Routineaufgaben zu automatisieren und\nZeit zu sparen. Dies kann Fehler minimieren und die Effizienz steigern.","type":"content","url":"/chapter01-sec01","position":1},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Lernziele"},"type":"lvl2","url":"/chapter01-sec01#lernziele","position":2},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Lernziele"},"content":"Lernziele\n\nSie können erklären, was ein Algorithmus ist.\n\nSie wissen, was eine Programmiersprache ist.\n\nSie kennen den Unterschied zwischen höheren Programmiersprachen und\nMaschinensprache.\n\nSie wissen, was der Unterschied zwischen einer kompilierten\nProgrammiersprache und einer interpretierten Programmiersprache ist. Sie\nkönnen für beide Kategorien Beispiele benennen.","type":"content","url":"/chapter01-sec01#lernziele","position":3},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Algorithmus"},"type":"lvl2","url":"/chapter01-sec01#algorithmus","position":4},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Algorithmus"},"content":"Programmieren bedeutet, dem Computer eine Reihe von Anweisungen zu geben. Es\ngeht darum, mit Hilfe einer Abfolge von Anweisungen ein Problem zu lösen. Ein\nwichtiger Aspekt des Programmierens ist die Fähigkeit, komplexe Probleme in\nkleinere, leichter zu lösende Aufgaben zu unterteilen. Diese Aufgaben können\ndann einzeln gelöst und in einem größeren Programm kombiniert werden, um das\nProblem als Ganzes zu lösen.\n\nDiese schrittweise Beschreibung der Lösung eines Problems nennt man\nAlgorithmus. Ein Algorithmus ist ein klar definierter Satz von Anweisungen\noder Regeln, die von einem Computer (oder auch von einem Menschen) ausgeführt\nwerden können, um ein bestimmtes Ergebnis zu erzielen.\n\nEin Beispiel aus dem Alltag ist die Steuerung eines Fahrstuhls:\n\nJemand drückt im Erdgeschoss den Knopf.\n\nDer Fahrstuhl fährt nach unten, hält an, und die Tür öffnet sich.\n\nDie Person steigt ein und wählt die 3. Etage.\n\nDer Fahrstuhl schließt die Tür, fährt hoch bis zur 3. Etage, hält wieder an,\nöffnet die Tür und die Person steigt aus.\n\nMini-Übung\n\nNehmen Sie sich 5 Minuten Zeit und schreiben Sie die Schritte auf, die ein\nFahrstuhl befolgen muss, um eine Person vom Erdgeschoss in die 2. Etage zu\nbringen.\n\nLösung\n\nWarte auf Knopfdruck im Erdgeschoss.\n\nFahre ins Erdgeschoss (falls nicht schon dort).\n\nÖffne Tür.\n\nWarte, bis Person eingestiegen ist.\n\nSchließe Tür.\n\nFahre in die 2. Etage.\n\nÖffne Tür.\n\nWarte, bis Person ausgestiegen ist.\n\nSchließe Tür.\n\nDie obige Lösung funktioniert nur für den Transport vom Erdgeschoss in die 2.\nEtage. Ein echter Fahrstuhl-Algorithmus muss aber allgemeiner sein und für\nbeliebige Start- und Zieletagen funktionieren. Das folgende Flussdiagramm zeigt\neinen solchen allgemeinen Algorithmus:flowchart TD\n    A[Start: Fahrstuhl wartet] --> B{Knopf außen gedrückt?}\n    B -->|Nein| B\n    B -->|Ja| C[Fahre zu der Etage mit dem Knopf]\n    C --> D[Öffne Tür]\n    D --> E{Person eingestiegen?}\n    E -->|Nein| E\n    E -->|Ja| F[Schließe Tür]\n    F --> G{Ziel-Knopf innen gedrückt?}\n    G -->|Nein| G\n    G -->|Ja| H[Fahre zur Ziel-Etage]\n    H --> I[Öffne Tür]\n    I --> J{Person ausgestiegen?}\n    J -->|Nein| J\n    J -->|Ja| K[Schließe Tür]\n    K --> A\n    \n    style A fill:#e1f5fe\n    style B fill:#fff3e0\n    style E fill:#fff3e0\n    style G fill:#fff3e0\n    style J fill:#fff3e0\n\nIn dem Flussdiagramm stehen die Rauten für Entscheidungen und die Rechtecke für\nAktionen. Der Pfeil zurück zum Start zeigt: Ein Fahrstuhl arbeitet in einer\nEndlosschleife und wartet kontinuierlich auf neue Anfragen.\n\nDie Beschreibung kann unterschiedlich detailliert sein. Zum Beispiel kann man\npräzisieren, wie lange die Tür geöffnet bleiben soll oder was passiert, wenn\ngleichzeitig andere Knöpfe gedrückt werden. Hier erkennt man: Ein Algorithmus\nkann sehr einfach beginnen, aber durch zusätzliche Fälle immer komplexer werden.\n\nMini-Übung\n\nÜberlegen Sie, welche zusätzlichen Regeln notwendig wären, wenn der Fahrstuhl\ngleichzeitig mehrere Anfragen erhält (z. B. jemand möchte in die 4. Etage und\njemand anders in die 2. Etage).\n\nLösung\n\nDer Fahrstuhl muss entscheiden, in welcher Reihenfolge die Stockwerke\nangefahren werden.\n\nMögliches Vorgehen: Immer in der aktuellen Fahrtrichtung alle Stockwerke\nbedienen, bevor gewendet wird.\n\nBeispiel: Wenn der Fahrstuhl im Erdgeschoss startet und Knöpfe für die 2. und\n4. Etage gedrückt sind, fährt er zuerst zur 2., dann zur 4. Etage.\n\nAuf die Idee, Alltagsprozesse in Form eines Algorithmus zu beschreiben, werden\nwir in späteren Kapiteln zurückkehren. Als nächstes beschäftigen wir uns damit,\nwie dem Computer solche Anweisungen in einer Programmiersprache erteilt werden.","type":"content","url":"/chapter01-sec01#algorithmus","position":5},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Programmiersprachen"},"type":"lvl2","url":"/chapter01-sec01#programmiersprachen","position":6},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Programmiersprachen"},"content":"Eine Programmiersprache ist eine formale Sprache, mit der sich\nDatenstrukturen und Algorithmen beschreiben lassen, sodass ein Computer diese\nAnweisungen ausführen kann.\n\nEs gibt nicht die eine wichtigste oder beste Programmiersprache. Welche\nSprache man verwendet, hängt immer von der Anwendung ab. Für ein\nSmartphone-Spiel wird eine andere Sprache gewählt als für die numerische\nSimulation in den Ingenieurwissenschaften. Einen Überblick über die Beliebtheit\nvon Programmiersprachen bietet der sogenannte Tiobe-Index:\n\nhttps://​www​.tiobe​.com​/tiobe​-index/\n\nMini-Übung\n\nRecherchieren Sie im Tiobe-Index nach den Programmiersprachen MATLAB und Python.\n\nAuf welchem Platz stehen die beiden Programmiersprachen aktuell?\n\nSchauen Sie sich auch die langfristige Entwicklung an. Wie haben sich beide\nSprachen in den letzten 10 Jahren entwickelt?\n\nLösung\n\nPython steht typischerweise in den Top 3, MATLAB meist zwischen Platz 15-20.\n\nPython zeigt seit Jahren einen deutlichen Aufwärtstrend, während MATLAB\nstagniert oder leicht rückläufig ist.\n\nBesonders für Ingenieurstudierende stellt sich oft die Frage: MATLAB oder\nPython? Während MATLAB traditionell in vielen technischen Fächern gelehrt wird,\nzeigt die Entwicklung der letzten Jahre einen klaren Trend zu Python. Dies liegt\nnicht nur an der größeren Vielseitigkeit, sondern auch daran, dass\nPython-Kenntnisse weit über die Ingenieurwissenschaften hinaus wertvoll sind.\n\nIn der Anfangszeit der Computer waren Programmiersprachen noch sehr nah an der\nMaschinensprache. Maschinensprache besteht aus Binärcode (Nullen und\nEinsen), den der Prozessor direkt ausführt. Hier ein Beispiel in Assembler,\neiner sehr maschinenorientierten Sprache, die bereits schwer lesbar ist:\n\n\n\nFigure 1:“Hallo Welt” in Assembler\n(Quelle: \n\nWikipedia → Assemblersprache)\n\nIn einer modernen Sprache wie Python ist der gleiche Code deutlich kürzer\nund leichter verständlich:\n\nprint('Hallo Welt')\n\n\n\nHeute arbeiten wir fast ausschließlich mit den sogenannten höheren\nProgrammiersprachen (wie Python, MATLAB oder C++), die für Menschen leichter\nverständlich sind. Damit Computer diese Anweisungen ausführen können, müssen sie\naber trotzdem in Maschinensprache übersetzt werden. Das geschieht auf zwei\nArten:\n\nCompiler-Sprachen: Der gesamte Code wird vorab in Maschinensprache\nübersetzt. Der Übersetzungsvorgang heißt Kompilieren.\n\nInterpreter-Sprachen: Der Code wird erst beim Ausführen Zeile für Zeile in\nMaschinensprache übersetzt. Der zeilenweise Ausführung wird Interpretieren\ngenannt.\n\nManchmal wird kompilierter Code als Programm und interpretierter Code als Skript\nbezeichnet. Im Alltag ist diese Unterscheidung aber nicht immer wichtig; oft\nsagt man zu beidem schlicht »Programm«.\n\nMini-Übung\n\nOrdnen Sie die folgenden Programmiersprachen zu: Sind sie kompiliert oder\ninterpretiert?\n\nC bzw. C++\n\nC# (ausgesprochen: C Sharp)\n\nJavaScript\n\nPython\n\nVisual Basic\n\nLösung\n\nC bzw. C++ → kompiliert\n\nC# → kompiliert\n\nJavaScript → interpretiert\n\nPython → interpretiert\n\nVisual Basic → kompiliert\n\nInsgesamt ist der Unterschied zwischen kompilierten und interpretierten Sprachen\nvor allem eine Frage der Geschwindigkeit und Flexibilität. Kompilierte Programme\nsind in der Regel schneller als interpretierte Programme, da der Maschinencode\ndirekt vom Betriebssystem ausgeführt werden kann. Umgekehrt können Änderungen\ndes Programms bei interpretierten Programmen schneller durchgeführt werden, da\ndiese ja ohnehin Zeile für Zeile abgearbeitet und interpretiert werden. Dies\nbedeutet, dass Änderungen am Code sofort wirksam werden, ohne dass eine erneute\nKompilierung erforderlich ist.\n\nLetztendlich hängt die Wahl der Programmiersprache von den Anforderungen des\nProjekts ab und davon, welche Kompromisse zwischen Geschwindigkeit und\nFlexibilität akzeptabel sind.","type":"content","url":"/chapter01-sec01#programmiersprachen","position":7},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Warum Python?"},"type":"lvl2","url":"/chapter01-sec01#warum-python","position":8},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Warum Python?"},"content":"Was ist überhaupt Python? Wikipedia beschreibt Python so:\n\n“Python ([ˈpʰaɪθn̩], [ˈpʰaɪθɑn], auf Deutsch auch [ˈpʰyːtɔn]) ist eine\nuniverselle, üblicherweise interpretierte, höhere Programmiersprache. Sie hat\nden Anspruch, einen gut lesbaren, knappen Programmierstil zu fördern. So\nwerden beispielsweise Blöcke nicht durch geschweifte Klammern, sondern durch\nEinrückungen strukturiert.”\n(Quelle: \n\nWikipedia)\n\nIn dieser Vorlesung verwenden wir Python als Programmiersprache, da Python viele\nVorteile für den Einstieg bietet:\n\nEinfache Syntax: Python hat eine klare und leicht verständliche Syntax, die\nes leicht macht, die Grundlagen der Programmierung zu erlernen. Die Syntax\nist lesbar und ähnelt der englischen Sprache, was das Verständnis\nerleichtert.\n\nVielseitigkeit: Python ist eine sehr vielseitige Programmiersprache, die in\nvielen verschiedenen Bereichen eingesetzt werden kann. Sie wird oft für\nDatenanalyse, künstliche Intelligenz, Webentwicklung und wissenschaftliches\nRechnen verwendet.\n\nGroße Community: Python hat eine große Community von Entwicklern, die aktiv\nan der Weiterentwicklung der Sprache und an der Bereitstellung von\nHilfestellung und Ressourcen für Anfänger beteiligt sind. Es gibt viele\nOnline-Foren, Kurse und Tutorials, die das Erlernen der Sprache erleichtern.\n\nInteraktiver Modus: Python bietet einen interaktiven Modus, der es\nAnfängern ermöglicht, Code Zeile für Zeile auszuführen und das Ergebnis\nsofort zu sehen. Dies macht das Experimentieren und die Suche nach Fehlern im\nCode sehr einfach und effektiv.\n\nPlattformunabhängigkeit: Python kann auf verschiedenen Betriebssystemen wie\nWindows, Mac und Linux ausgeführt werden.\n\nDas Erlernen einer Programmiersprache ist ein bisschen wie das Lernen einer\nFremdsprache: Die erste ist die schwierigste. Danach fällt der Umstieg auf\nandere Sprachen wesentlich leichter.","type":"content","url":"/chapter01-sec01#warum-python","position":9},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Zusammenfassung und Ausblick"},"type":"lvl2","url":"/chapter01-sec01#zusammenfassung-und-ausblick","position":10},{"hierarchy":{"lvl1":"1.1 Algorithmus und Programmiersprachen","lvl2":"Zusammenfassung und Ausblick"},"content":"In diesem Kapitel haben wir die Vorteile des Programmierens für Ingenieure\ndiskutiert, den Begriff des Algorithmus anhand der Fahrstuhlsteuerung eingeführt\nund die Unterschiede zwischen verschiedenen Programmiersprachen erklärt.\nAußerdem haben wir gesehen, warum Python als erste Sprache besonders geeignet\nist. Im nächsten Kapitel beschäftigen wir uns mit den technischen\nVoraussetzungen, um eigene Python-Programme zu schreiben, und benutzen Python\nals Taschenrechner.","type":"content","url":"/chapter01-sec01#zusammenfassung-und-ausblick","position":11},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner"},"type":"lvl1","url":"/chapter01-sec02","position":0},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner"},"content":"In dieser Vorlesung werden wir das Python-Programmieren mit Hilfe von Jupyter\nNotebooks lernen. Daher klären wir zunächst, was Jupyter Notebooks sind, und\nverwenden anschließend Python als Taschenrechner. Ergebnisse von einfachen\nRechnungen lassen wir uns mit der print()-Funktion anzeigen.","type":"content","url":"/chapter01-sec02","position":1},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Lernziele"},"type":"lvl2","url":"/chapter01-sec02#lernziele","position":2},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Lernziele"},"content":"Lernziele\n\nSie wissen, was ein Jupyter Notebook ist.\n\nSie können Python als Taschenrechner benutzen.\n\nSie können Ergebnisse von Rechnungen mit print() anzeigen.\n\nSie wissen, was ein Argument einer Anweisung ist.","type":"content","url":"/chapter01-sec02#lernziele","position":3},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Was sind Jupyter Notebooks?"},"type":"lvl2","url":"/chapter01-sec02#was-sind-jupyter-notebooks","position":4},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Was sind Jupyter Notebooks?"},"content":"Jupyter Notebooks führen Text, Python-Code, Bilder und Videos in einem einzigen\ninteraktiven digitalen Notizbuch zusammen. Sie gehören zu den bekanntesten\nAnwendungen in der Programmierung und werden häufig für Datenanalyse,\nmaschinelles Lernen, Simulationen und Visualisierungen eingesetzt.\n\nEin Jupyter Notebook besteht aus einer Abfolge von Zellen, in denen Text,\nCode oder Grafiken eingebettet werden. Die Zellen können entweder in Python oder\nin anderen Programmiersprachen wie R, Julia oder JavaScript geschrieben sein.\nErkennbar sind Jupyter Notebooks an der Dateiendung .ipynb.\n\nDie Kombination von Text, Code und Visualisierungen macht Jupyter Notebooks zu\neinem besonders geeigneten Werkzeug für das Programmierenlernen: Konzepte\nwerden im Text erläutert und können direkt in Code-Zellen ausprobiert werden.\n\n\n\nFigure 1:Screenshot eines Jupyter Notebooks mit Text, Python-Code und Ergebnissen des\nausgeführten Python-Codes, das mit der “JupyterLab” geladen wurde (Quelle:\neigene Darstellung; Lizenz \n\nCC BY-NC-SA\n4.0)\n\nEine Zelle kann entweder eine Text-Zelle (siehe Screenshot, Schritt 1) oder eine\nCode-Zelle (siehe Screenshot, Schritt 2) sein. In Text-Zellen wird die\n\n\nMarkdown​-Formatierung\nverwendet. Um ein Wort fettgedruckt anzuzeigen, schreibt man zum Beispiel\n**fett**, was als fett dargestellt wird. In Code-Zellen (siehe Screenshot,\nSchritt 2 oder 3) können Sie direkt Python-Code eingeben. Eine Code-Zelle wird\nausgeführt, indem Sie auf “Run” klicken (siehe Screenshot, Schritt 4). Danach\nerscheint die Ausgabe, die der Python-Interpreter ggf. erzeugt (siehe\nScreenshot, Schritt 5). Ergebnisse werden mit “Out” gekennzeichnet.","type":"content","url":"/chapter01-sec02#was-sind-jupyter-notebooks","position":5},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Python als Taschenrechner"},"type":"lvl2","url":"/chapter01-sec02#python-als-taschenrechner","position":6},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Python als Taschenrechner"},"content":"Bevor wir in die Programmierung einsteigen, benutzen wir Python erst einmal als\nTaschenrechner. Im Folgenden sehen Sie, wie die Grundrechenarten in Python\nverwendet werden:\n\nAddition:\n\n2+3\n\n\n\nSubtraktion:\n\n2-3\n\n\n\nMultiplikation:\n\n2*4\n\n\n\nDivision:\n\n8/2\n\n\n\nPotenzierung:\n\n3**2\n\n\n\nSie können die obigen Code-Zellen verändern, zum Beispiel 2 + 3 in 2 + 5\nändern. So lernen Sie den Umgang mit Python-Anweisungen kennen.\n\nWenn Sie dieses Skript als interaktives Jupyter Notebook öffnen, können Sie\ndirekt in die Zellen klicken und den Code ändern. Falls Sie das Skript online\nlesen, klicken Sie bitte auf das Raketensymbol oben rechts und wählen „Live\nCode“, um interaktive Zellen zu aktivieren. Beim ersten Start kann dies etwas\ndauern.\n\nUm Übungen zu ermöglichen, enthalten manche Zellen nur einen Kommentar als\nPlatzhalter:\n\n# Geben Sie nach diesem Kommentar Ihren Code ein:\n\n\n\nAlles was nach dem Hashtag # steht, ist ein Kommentar. Kommentare werden von\nPython ignoriert und sind nur für uns Menschen gedacht.\n\nSelbstverständlich beherrscht Python auch Klammerregeln. Probieren Sie es aus!\n\nMini-Übung\n\nLassen Sie Python den Term 3\\cdot (7-10)+5 berechnen.\n\n# Geben Sie nach diesem Kommentar Ihren Code ein:\n\n\n\nLösung3 * (7-10) + 5","type":"content","url":"/chapter01-sec02#python-als-taschenrechner","position":7},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Ausgaben mit print"},"type":"lvl2","url":"/chapter01-sec02#ausgaben-mit-print","position":8},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Ausgaben mit print"},"content":"Bei den obigen Rechenaufgaben wurde automatisch das Ergebnis der Rechnung\nangezeigt, sobald die Code-Zelle ausgeführt wurde. Dies ist eine Besonderheit\nder Jupyter Notebooks. In einem normalen Python-Programm würde das nicht\nfunktionieren. Die interaktive Ausgabe der Jupyter Notebooks zeigt außerdem\nimmer nur das Ergebnis der letzten Zeile an.\n\nUm beliebige Ergebnisse oder Texte gezielt auszugeben, gibt es die\nprint()-Funktion.\n\nprint(2)\nprint(3+3)\n\n\n\nDas Argument wird in runde Klammern hinter den Funktionsnamen print\ngeschrieben. Ein Argument ist sozusagen der Input, der an die Funktion übergeben\nwird, damit Python weiß, welcher Wert auf dem Bildschirm angezeigt werden soll.\n\nDas zweite Beispiel in der zweiten Zeile funktioniert genauso. Nur wird diesmal\neine komplette Rechnung als Argument an die print()-Funktion übergeben. In dem\nFall rechnet der Python-Interpreter erst den Wert der Rechnung, also 3+3=6 aus\nund übergibt dann die 6 an die print()-Funktion. Die print()-Funktion\nwiederum zeigt dann die 6 am Bildschirm an.\n\nInsgesamt zeigt daher der Python-Interpreter erst eine 2 und dann in der\nnächsten Zeile eine 6 an.\n\nMini-Übung\n\nLassen Sie Python den Term 3:4 berechnen und geben Sie das Ergebnis mit der\nprint()-Funktion aus.\n\n# Geben Sie nach diesem Kommentar Ihren Code ein:\n\n\n\nLösungprint(3/4)\n\nAchtung: In Python wird für die Division / verwendet, nicht :. Das ist ein\nhäufiger Fehler.\n\nPython kann mit der print()-Funktion jedoch nicht nur Zahlen ausgeben, sondern\nauch Texte. Ein erster Versuch, einfach den Text als Argument der\nprint()-Funktion zu übergeben, scheitert leider, wie das nächste Beispiel zeigt.\n\n# Achtung, die nachfolgende Code-Zeile enthält einen Fehler!\nprint(Hallo)\n\n\n\nEs erscheint eine Fehlermeldung mit dem Fehler: NameError: name 'Hallo' is not defined. Der Grund hierfür ist, dass der Python-Interpreter versucht, eine\nsogenannte Variable oder eine Python-Anweisung mit dem Namen Hallo zu finden.\nDa es aber keines von beiden gibt, kommt die Fehlermeldung, dass Hallo nicht\ndefiniert wurde. Um den Text ausgeben zu lassen, werden um den Text einfache\noder doppelte Anführungszeichen gesetzt, wie in dem folgenden Beispiel.\n\nprint('Hallo')\n\n\n\nMini-Übung\n\nProbieren Sie aus was passiert, wenn Sie die einfachen Anführungszeichen '\ndurch doppelte Anführungszeichen \" ersetzen. Lassen Sie den Text Hallo Welt\nausgeben.\n\n# Geben Sie nach diesem Kommentar Ihren Code ein:\n\n\n\nLösungprint(\"Hallo Welt\")\n\nIn Python sind sowohl einfache als auch doppelte Anführungszeichen erlaubt.\nWenn ein Apostroph im Text vorkommt, sollten Sie doppelte Anführungszeichen\nverwenden.\n\nDie print()-Funktion kann noch viel mehr, als wir in dieser Einführung\ngesehen haben. Wir werden in einem späteren Kapitel im Zusammenhang mit den\nsogenannten f-Strings nochmal darauf zurückkommen.\n\nHinweis: Das folgende Video nutzt eine andere Entwicklungsumgebung (PyCharm) als\nwir in dieser Vorlesung. Wir nutzen die Entwicklungsumgebung JupyterLab. Die\ngrundlegenden Python-Befehle sind jedoch identisch. Fokussieren Sie sich ab\nMinute 9 auf die Python-Syntax, nicht auf die Bedienung der Software.\n\nVideo “Dein erstes Python-Programm” von Programmieren Starten","type":"content","url":"/chapter01-sec02#ausgaben-mit-print","position":9},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Zusammenfassung und Ausblick"},"type":"lvl2","url":"/chapter01-sec02#zusammenfassung-und-ausblick","position":10},{"hierarchy":{"lvl1":"1.2 Jupyter Notebooks und Python als Taschenrechner","lvl2":"Zusammenfassung und Ausblick"},"content":"In diesem Kapitel haben wir Jupyter Notebooks kennengelernt, Python als\nTaschenrechner genutzt und die erste Python-Anweisung print() eingesetzt. Im\nnächsten Kapitel geht es um das Speichern von Daten und deren Verwaltung.","type":"content","url":"/chapter01-sec02#zusammenfassung-und-ausblick","position":11},{"hierarchy":{"lvl1":"Übungen"},"type":"lvl1","url":"/chapter01-sec03","position":0},{"hierarchy":{"lvl1":"Übungen"},"content":"Übung 1.1\n\nInstallieren Sie Anaconda auf Ihrem System. Starten Sie JupyterLab und erstellen\nSie ein neues Notebook. Bei Problemen konsultieren Sie die\nInstallationsanleitung.\n\nÜbung 1.2\n\nBenutzen Sie Python als Taschenrechner. Fügen Sie dazu diesem Jupyter Notebook\neine Code-Zelle hinzu und lassen Sie die folgenden Ausdrücke berechnen:\n\n2 + 3\n\n2 - 3\n\n4 * 5\n\n16 / 4\n\n16 / 3\n\n5**2\n\nLösungprint(2+3)\nprint(2-3)\nprint(4*5)\nprint(16/4)\nprint(16/3)\nprint(5**2)\n\nÜbung 1.3\n\nIn der vorhergehenden Aufgabe haben Sie den Ausdruck 5**2 berechnen lassen.\nFügen Sie jetzt eine Markdown-Zelle ein. Schreiben Sie auf, was Ihrer Vermutung\nnach der **-Operator für eine Bedeutung hat. Recherchieren Sie anschließend im\nInternet, nach seiner Bedeutung und vergleichen Sie Ihre Antwort mit der Recherche.\nFügen Sie die Internetseite als URL in die Markdown-Zelle ein.\n\nLösung\n\nDie beiden Sterne ** stehen für das Potenzieren. Eine kurze Beschreibung findet sich hier:\n[\n\nhttps://​www​.w3schools​.com​/python​/gloss​_python​_arithmetic​_operators​.asp]\n\nÜbung 1.4\n\nSpeichern Sie das bearbeitete Jupyter Notebook unter einem anderen Namen ab.\n\nLösung\n\nSehen Sie sich den folgenden Screencast an.\n\n\nÜbung 1.5\n\nProbieren Sie bewusst falsche Python-Anweisungen aus und beobachten Sie die\nFehlermeldungen.\n\nGeben Sie print(Hallo Welt) ein (ohne Anführungszeichen).\n\nVersuchen Sie 2 +* 3 (falsche Operatorenkombination).\n\nSchreiben Sie Print(5) (großes P) .\n\nNotieren Sie in einer Markdown-Zelle, welche Fehlermeldungen erscheinen und was\nsie bedeuten könnten.\n\nLösung\n\nprint(Hallo Welt) ohne Anführungszeichen führt zu der Fehlermeldung\nSyntaxError: invalid syntax. Syntax ist der Fachbegriff für die Grammatik\neiner Sprache. Diese Anweisung ist ungültig, weil Hallo Welt nicht als\nString gekennzeichnet wurde, also in Anführungszeichen gesetzt wurde.\n\nDie Anweisung 2 +* 3 führt ebenfalls zu einem Grammatikfehler, also\nSyntaxError: invalid syntax.\n\nDie Anweisung Print(5) führt zu einem Namensfehler NameError: name 'Print' is not defined. Python achtet penibel auf Groß- und Kleinschreibung. Den\nBefehl Print() mit einem großem P kennt Python daher nicht und meldet\ndeshalb den NameError.\n\nÜbung 1.6\n\nErstellen Sie eine Code-Zelle mit folgendem Inhalt:# Das ist ein Kommentar\nprint(7 + 3)  # Hier wird 7 + 3 berechnet\n# print(5 * 2)\nprint(8 - 2)\n\nFühren Sie die Zelle aus. Erklären Sie in einer Markdown-Zelle, warum manche\nZeilen ausgeführt werden und andere nicht.\n\nLösung\n\nEs werden nur die Zeilen ausgeführt, in denen kein Kommentarzeichen #\nsteht.\n\nÜbung 1.7\n\nBerechnen Sie folgende Ausdrücke und vergleichen Sie die Ergebnisse:\n\n2 + 3 * 4\n\n(2 + 3) * 4\n\n2**3*4\n\n2**(3*4)\n\nSchreiben Sie in eine Markdown-Zelle, welche Regeln Python für die Reihenfolge\nder Operationen befolgt.\n\nLösung\n\nEs gelten die folgenden Regeln für die Reihenfolge der Operationen:\n\nPunkt- vor Strichrechnung (als erst * und \\ vor + und -).\n\nKlammern werden immer zuerst berechnet.\n\nPotenzen werden vor +, -, *, \\ berechnet. Erst wird \n\n23 berechnet,\nwas 8 ergibt, und dann mit 4 multipliziert, so dass das Endergebnis 32 ist.\nDas Endergebnis ist nicht 2^{12} = 4096.\n\nKlammern werden weiterhin zuerst berechnet, also vor der Potenzierung\nausgewertet. Das Ergebnis ist 4096.\n\nÜbung 1.8\n\nExperimentieren Sie mit der print()-Funktion:\n\nprint(\"Mein Name ist\", \"Max\")\n\nprint(\"Das Ergebnis ist:\", 5*6)\n\nprint(2, 4, 6, 8)\n\nWas beobachten Sie, wenn print() mehrere Argumente erhält?\n\nLösung\n\nWerden der print()-Anweisung zwei Argumente übergeben, werden beide Argumente\nin einer Zeile angezeigt. Das Komma, das die beiden Argumente trennt, wird nicht\nausgegeben. Aus  print(\"Mein Name ist\", \"Max\") wird also der Text Mein Name ist Max. Das funktioniert auch bei Zahlen und sogar Rechnungen. Aus print(\"Das Ergebnis ist:\", 5*6) wird Das Ergebnis ist: 30.\n\nPython lässt in der print()-Funktion beliebig viele Argumente zu. Auch\nbeispielsweise vier Argumente wie in der Anweisung print(2, 4, 6, 8)\nfunktionieren, die Ausgabe ist 2 4 6 8.\n\nÜbung 1.9\n\nBerechnen Sie mit Python typische Ingenieursaufgaben, z.B.\n\nden Umfang eines Kreises mit Radius 5 cm (U = 2\\pi r, verwenden Sie \\pi\n\\approx 3.14159),\n\ndie Fläche eines Rechtecks mit Länge 12 m und Breite 8 m oder\n\ndie Geschwindigkeit eines Autos bei gleichförmiger Bewegung mit Weg 150 km in\nZeit 2.5 h.\n\nVerwenden Sie print() um die Ergebnisse mit beschreibendem Text auszugeben.\nWie kann Ihnen die vorherige Aufgabe dabei helfen?\n\nLösungprint('Der Umfang des Kreises mit r =', 5, 'ist', 2 * 5 * 3.14159, '.')\nprint('Die Fläche des Rechtecks mit Seite a =', 12, 'und Seite b =', 8, 'ist', 12*8, '.')\nprint('Die Geschwindigkeit ist', 150/2.5, 'km/h, wenn s =', 150, 'km und t =', 2.5, 'h .')","type":"content","url":"/chapter01-sec03","position":1},{"hierarchy":{"lvl1":"Willkommen zu meinem Vorlesungsskript Python"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Willkommen zu meinem Vorlesungsskript Python"},"content":"TH Mannheim","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Willkommen zu meinem Vorlesungsskript Python","lvl2":"Vorlesungsskript Python"},"type":"lvl2","url":"/#vorlesungsskript-python","position":2},{"hierarchy":{"lvl1":"Willkommen zu meinem Vorlesungsskript Python","lvl2":"Vorlesungsskript Python"},"content":"\n\nDie Digitalisierung in den Ingenieurwissenschaften nimmt zu. Daher bietet dieser\nPython-Kurs zukünftigen Ingenieurinnen und Ingenieuren einen Einstieg in die\ngrundlegenden Programmiertechniken mit Python. Jedes Kapitel entspricht dabei\neiner Vorlesung mit integrierten Übungen von 90 min Dauer. Weitere Übungen\ndienen der Vertiefung der gelernten Inhalte im Selbststudium.\n\ntoc","type":"content","url":"/#vorlesungsskript-python","position":3},{"hierarchy":{"lvl1":"Inhaltsverzeichnis"},"type":"lvl1","url":"/toc","position":0},{"hierarchy":{"lvl1":"Inhaltsverzeichnis"},"content":"Python\n\nInhaltsverzeichnis\n\n1. Grundlagen und erste Schritte\n\n1.1 Algorithmus und Programmiersprachen\n\n1.2 Jupyter Notebooks und Python als Taschenrechner\n\nÜbungen","type":"content","url":"/toc","position":1}]}